{"version":"https://jsonfeed.org/version/1.1","title":"@iurare/rss","home_page_url":"https://github.com/iurare","feed_url":"https://iurare.github.io/feed/rss.json","icon":"https://avatars.githubusercontent.com/u/16333253","items":[{"id":"https://okuranagaimo.blogspot.com/2022/06/devops.html","url":"https://okuranagaimo.blogspot.com/2022/06/devops.html","title":"DevOpsは失敗する","content_html":"<blockquote> <p><a href=\"https://okuranagaimo.blogspot.com/\">ブログ</a> <strong>DevOpsは失敗する</strong></p> <p>by Unknown <i>#Computer</i></p> <p><a href=\"https://leebriggs.co.uk/blog/2022/06/21/devops-is-a-failure\">lbr.より</a>。</p><blockquote class=\"ref\"><p>BY リー・ブリッグス</p> <p>初めて聞いた言葉を思い出すのは、ほとんどの人にとって難しいことでしょうが、私は初めて「DevOps」という言葉を聞いた時のことを覚えています。2013年、その時点で私が知っていることのほとんどすべてを教えてくれた同僚とビールを飲んでいるときのことでした。私は幸運にも、自分が始めた新しい仕事に彼を連れてくることができました。彼は、多くの気の利いたことができ、私は彼の力に便乗することができました。私たちは、新しい会社で目にした問題のいくつかを話し合っていました。それは、おそらく今ではほとんど人にとって身近に感じられるものでしょう。アプリケーションが本番稼働しているときのサポートに苦労していたのです。</p> <p>彼は、私たち全員が同じ考えを持つためには、ライフサイクルの早い段階から関与する必要があると話していました。その時、彼がオーストラリア訛りで言った「DevOps」という言葉が、私の心に残りました。</p> <p>2013年は、DevOpsの登場が比較的遅れたのです。この言葉の起源について多くの人に尋ねると、トロントでのアジャイル会議でパトリック・デュボアとアンドリュー・クレイ・シェーファーが出会ったことと、<a href=\"https://www.youtube.com/watch?v=LdOe18KhtT4\">Velocity '09でジョン・オルスポーとポール・ハモンド</a>による講演です。</p> <p>当時の考え方は、「カルチャーを直そう」というシンプルなものでした。それ以来、この言葉は一人歩きをしています。今では、「DevOpsエンジニア」という役職もあります。</p> <p>分野としてのDevOpsについて、私がいつも不思議に思っているのは、この言葉がどれだけ運用側に偏っているのかということです。これを読んでいる人なら誰でも、「DevOps」を成功させるためには、両陣営が参加する必要があることに同意すると思います。しかし、私がこれまで参加したDevOpsカンファレンスを思い出してみると、私が集めた事例証拠は、カンファレンスには運用者が多く参加し、開発者はあまり参加していないということです。</p> <h3>DevOpsは単なる運用</h3> <p>オーストラリアの友人との会話から5年後、同じ会社で別の会議に出席していたとき、ある製品の開発を率いるディレクタークラスの同僚が、自分のチームは「真のDevOps」であると言いました。私はこの時、非常に困惑したことを覚えています。彼らは運用上のニーズについて私たちに話したことはなく、彼らが何をしているのかさえ知りませんでした。私たちが知っていたのは、彼らがアプリケーションをデプロイするためにAWS ECSを使っているということだけです。運用チームが関与していないのに、どうして彼らは「真のDevOps」になるのでしょうか?</p> <p>チームの開発者たちと会話をするうちに、私は彼の言っている意味が分かりました。彼の開発者たちは、アプリケーションのライフサイクル全体を管理していたのです。彼らはboto3を使い、新しいリリースを出荷するためにデプロイメント・スクリプトを書いていたのです。彼らは、バックエンド・エンジニアの仕事だけでなく、AWSに精通した「フルスタック・エンジニア」を雇っていました。プラットフォーム・エンジニアリングの考え方を早くから取り入れていた私は、なぜこのようなことが行われているのか、ちょっと戸惑いました。私たちは<a href=\"https://www.infoq.com/news/2017/06/paved-paas-netflix/\">Netflixスタイルの舗装道路</a>の建設に向けて順調に進んでおり、その理由はすべて、彼らの生活を楽にするために、デプロイとインフラスのライフサイクルの管理に伴うすべての苦痛を取り除くためでした。彼らが「真のDevOps」と言ったのは、自分たちがオペレーション作業を行うという意味だけでした。なぜ、このような方法を取っていたのでしょうか?</p> <h3>ターニングポイント</h3> <p>その後の会話は、DevOpsに関する私の世界観全体を根本的に変えることになりましたが、それは数年後、私がPulumiに入社してからのことです。私たちは、GitLab CIやTerraform、Kubernetesなど、今日の運用担当者が知っているような、試行錯誤されたツールで舗装道路を構築していたのですが、その問題に少しばかり手をつけ始めていました。こんな感じです。</p> <blockquote class=\"ref\">私たちのプラットフォームを使ってみるべきです! 私たちは、この問題をすべて解決し、あなた方が作ったものよりもずっと素晴らしいものにしています。 </blockquote> <blockquote class=\"ref\">ありがとうございます、でも興味はありません。 </blockquote> <blockquote class=\"ref\">なぜですか? より信頼性が高く、高速で、業界標準のツールを使用していますよ。 </blockquote> <blockquote class=\"ref\">ええ、でも私たちはそのようなことを一切知りません。私たちは自分たちが作ったものを理解しています。 </blockquote> <p>私は絶望して手を挙げ、いつの日か彼らが自分たちの過ちに気付き、私たちに助けを求めてくることを信じて、立ち去りました。結局のところ、運用でした。私たちはクラウドでソフトウェアを実行する方法を知っています。</p> <p>この時点では、どれも特別なことではありませんでした。私は何年もかけて開発者たちをテーブルに着かせ、彼らの運用のオーバーヘッドを自分のものにしようとしてきました。私は彼らにDevOpsカンファレンスに参加するよう説得しました。弁当持参で、私たちが構築したプラットフォームが何をするのか、それがどのように彼らの役に立つのかを説明しました。私は、開発者の会話の中で議論し、戦い、そしてほとんどの場合は脅して、会社全体に「DevOps」の考え方を持ち込もうと必死になっていましたが、このチームが解釈した方法は「自分たちでやるから、ありがとう」でした。</p> <p>18か月後、私は次にステップに進みました。それから、2年後、私は自分が如何に根本的に間違っていたか、そして私たちが知っているDevOpsは完全に失敗している、と言っています。</p> <p><a href=\"https://pulumi.com/\">Pulumi</a>に入社してからは、開発者の世界という別のレンズを通して世界を見るようになりました。</p> <h3>失敗したら、ただの傲慢</h3> <p>当時を振り返ると、この文化を変えようとした試みが、なぜ失敗したのかは明らかですが、当時はそれが見えていませんでした。DevOpsが始まった頃のアイデアを思い出すと、ポイントは開発者と運用の間の摩擦を取り除くことでした。運用が「ノー」と言うのをやめさせ、開発者が「ヨロ、出荷しよう」と言うのをやめさせることです。このようなアイデアや目標は今でも崇高なものであり、組織は今日でもそれを目指すべきですが、DevOpsの世界は実際にはどのようなものなのでしょうか?</p> <p>結局のところ、2022年のDevOpsに対する私の評価はこうです。</p> <p><b>DevOpsは、運用側の人間が開発者に自分たちのやり方を納得させようとするものだ</b></p> <p>「DevOpsツール」として販売されているツールのほとんどすべてが、運用に焦点を当てたものです。/r/devopsを閲覧すると、運用や運用ツールについて語る人々の投稿が次から次へと出てきます。DevOpsエンジニアの職務記述書を見ると、2013年のシステム管理者の役割と驚くほど似ていますが、サーバのラッキングやスタッキングの代わりに、コンテナやクラウド・プロバイダの管理をしています。</p> <p>もし、DevOpsが全体的な文化を変えるためのものであるなら、それは成功した動きとは見なされません。運用サイドの人々は、「まあ、やってみよう!」と喜んで言うでしょうが、彼らが言いたいのは、運用上の配慮を促す笛吹き役になろうとしているということです。これは、相互的なものではありません。</p> <p>運用担当者として覚えておきたいのは、一般的に、どのようなエンジニアリング組織においても、私たちは少なくとも5対1の数で劣っているということです。開発者全員に、「運用方法」や「運用ツールを使う」ことを納得させようとするのは、結局のところ愚の骨頂なのです。私たちには変革が必要なのです。</p> <h3>どうすればいいのでしょうか?</h3> <p>結局のところ、「DevOps」という言葉を守るには遅すぎると思います。もし、人々がDevOpsを売り込んでいるのであれば、おそらく手遅れです。ここから私が望んでいるのは、DevOps担当者の日常的な役割における考え方の根本的な転換です。</p> <p>覚えにくいこともありますが、運用を重視する私たちの役割は、開発者がその機能を顧客の手に届けること(あるいは、その他のビジネス上の目標)を可能にし、促進することなのです。最も抵抗が少ない道を作ることは、製品や機能を出荷する開発者の速度を鍛え、維持するために不可欠な要素です。開発者がすべての運用方法を学び、維持することは、スケーラブルでも実現可能でもありません。</p> <p>ここまで読んで、「DevOps」が開発者をフェンス越しに運用の世界に連れて来ようとした試みであることに同意し、その試みがほとんど失敗したことにも同意するなら、新しい言葉が必要であることに同意していただけるでしょう。</p> <p>そこで、私は一つの言葉を投げかけました。SoftOpsを試してみましょう。</p> <h3>SoftOps: ソフトウェア開発者のための運用</h3> <p>もしあなたが最初に「くだらない名前だな」と思ったなら、その通りです。でも、きっと覚えてもらえる筈です。</p> <p>SoftOpsとは、開発者の生活をより良くすることに焦点を当てた運用手法を構築しようという考え方です。私たちは、開発者に何をすべきかを指示するのではなく、運用面で何をしたいのかを尋ね、それを可能な限り容易にするつもりです。</p> <p>「このツールをダウンロードして、48ページのマニュアルを読んで、大急ぎの締め切りに間に合わないことをPMに伝える」という時代は終わり、それに加えて、「ただ渡せばやってあげる」という時代も終わります。</p> <p>SoftOpsは、主要な顧客である開発者を第一に考えるという考え方です。開発者の世界に語りかけるような運用手法を構築すれば、(理論的には)開発者をテーブルに呼び寄せ、共同作業を行うことができる筈です。この目標だけに集中すれば、2009年にDevOpsが解決しようとした問題を、最終的に解決できるかも知れません。</p> <p>私に賛成の人は?</p></blockquote><p><a href=\"https://news.ycombinator.com/item?id=31887322\">Hacker News</a></p> <p>Article URL: <a href=\"https://okuranagaimo.blogspot.com/2022/06/devops.html\">https://okuranagaimo.blogspot.com/2022/06/devops.html</a></p> </blockquote>","date_published":"2022-07-04T12:32:17.698Z"},{"id":"https://okuranagaimo.blogspot.com/2022/07/blog-post_67.html","url":"https://okuranagaimo.blogspot.com/2022/07/blog-post_67.html","title":"データベースについて知っておくべきこと","content_html":"<blockquote> <p><a href=\"https://okuranagaimo.blogspot.com/\">ブログ</a> <strong>データベースについて知っておくべきこと</strong></p> <p>by Unknown <i>#Computer</i> <i>#Technology</i></p> <p><a href=\"https://architecturenotes.co/things-you-should-know-about-databases/\">architecture notesより</a>。</p><blockquote class=\"ref\"><p>この記事は、「知っておくべきこと」というシリーズの最初の記事です。様々なテーマについて、基本原則からレベルアップするための入門書と考えて下さい。今日は、データベースについて説明します!</p> <p>マハディ・ユスフ</p> <p>データベースは、アプリケーションのほぼすべての状態を格納しているにもかかわらず、表面的にはどのように動作しているのかほとんど知られていないことに驚かされることがよくあります。しかし、これはほとんどのシステムで成功するための基礎となるものです。そこで今日は、RDBMSのインデックスとトランザクションを扱う上で最も重要な2つのテーマについて説明します。</p> <p>データベース特有の癖に深く立ち入ることなく、RDBMSのインデックスについて理解すべきことを全て説明します。トランザクションと独立性レベルについても簡単に触れ、それらが特定のトランザクションに関するあなたの論拠にどのように影響を与えるかについて説明します。</p> <div class=\"separator\" style=\"clear: both;\"><img alt=\"\" border=\"0\" height=\"424\" width=\"600\" src=\"https://blogger.googleusercontent.com/img/b/R29vZ2xl/AVvXsEg56AMQctNjJTuncsft5lcOEcQFPq4GGlyDUpzdJ8WQoWcUw9FgBzNBZaJEL6Kq7OpT9XpApTP4PE69DbVPpPVDxcD7DEuGcGA52bmwoEBlrNjuFpwhG_VqcxKOdUJx5N_9IBNy7r2xxkHQ_53r5a-U2b62_K9eawRDjFwT5pTyiQ1I5DwE89dyLJJvCQ/s1600/Databases-01-1.jpg\"/></div> <blockquote class=\"tweet\"><p><b>RDBMSとは何か?</b></p><p>リレーショナル・データベースとは、1970年にエドガー・F・コッドが提唱したリレーショナル・データ・モデルに基づくデジタル・データベースです。リレーショナル・データベースの管理には、リレーショナル・データベース管理システム(RDBMS)が使用されます。多くのリレーショナル・データベース・システムには、データベースのクエリと保守にSQL(Structured Query Language)を使用するオプションがあります。例としては、MySQLやPostgreSQLなどがあります。</p></blockquote> <h3>インデックスとは何か?</h3> <p>インデックスは、要求されたデータの探索時間を短縮するのに役立つデータ構造です。インデックスは、ストレージ、メモリ、最新の状態に保つ(書き込みが遅い)ための追加コストでこれを実現し、テーブルの行をすべてチェックするという面倒な作業を省略することができます。</p> <p>教科書の後ろの方にある索引のように、正しいページにたどり着くためのを手助けをしてくれるのです。私はこの本の例えはあまり好きではありません。この例えは、データベースのインデックスを深く掘り下げていくと、すぐに崩れてしまいますが、このテーマを紹介するには最適な方法だと思います。</p> <h4>なぜインデックスが必要なか?</h4> <p>少量のデータであれば管理可能ですが(少人数のクラスの出席簿を考えてみて下さい)、データが大きくなると(大都市の出生登録を考えてくみて下さい)、そうもいかなくなるのです。以前は速かったものが、遅くなり、それは遅過ぎる程です。</p> <p>もし、1ページで何かを見つけるのと、何千ページもある中で何かを見つけなければならない場合、戦略がどう変わるかを考えてみて下さい。いや、真剣に、少し時間を取って考えてみて下さい。</p> <p>一部のデータベースは、ある時点で思いつく限りの優れた戦略をほとんどすべて実装されています。それらが増大するにつれ、システムはより多くのデータを収集し、保存するようになり、最終的には上記のような問題を引き起こします。</p> <p>必要な関連データをできるだけ早く取得するために、インデックスが必要なのです。</p> <h4>インデックスはどのように機能するか?</h4> <div class=\"separator\" style=\"clear: both;\"><img alt=\"\" border=\"0\" height=\"365\" width=\"500\" src=\"https://blogger.googleusercontent.com/img/b/R29vZ2xl/AVvXsEgq91lnMCRYX4RDstuqp8WLtIIxYDbcmNxOLl9I4PW0czuExJzw7u3KzTRlaq79rsPwcy-5xxQhlcEIFBmya_suVntMovjCtuHtgyf7ruGMvrnWOQY6YRtbCZ2zIH65aAH2Tp1PmCkNqflpFR19EZbz4pYqht6Ipt_zgWCTCy_ysRfSwx3-_dSTb2VbbQ/s1600/Databases-01-3.jpg\"/></div><p><small>インデックスを作成すると、読み取り性能は向上しますが、インデックスを最新の状態に保つ必要があるため、書き込み性能は犠牲になります。</small></p> <p>そこで、よく提起される解決策の1つは、このデータを検索方法に応じて論理的に保存することです。つまり、リストを名前で検索する場合は、ファーストネームでリストを並べ替えます。この戦略には、いくつか問題があります。ここでは読者への質問として、その問題を提起することにします。</p> <ol><li>データを複数の方法で検索したい場合はどうすればいいですか?</li><li>新しいデータをリストに追加する場合、どのように処理しますか? それは速いですか?</li><li>更新にどのように処理しますか?</li><li>これらのタスクのO記法は?</li></ol> <p>考えておくことがあります。最初の戦略がどうであれ、順序を維持し、順序のない関連データを素早く取得する方法が必要です。(これについてはまた後日)</p> <p>図1.1を参照して下さい。</p> <table><tbody><tr><td>id</td> <td>name</td> <td>city</td></tr><tr><td>1</td> <td>Mahdi</td> <td>Ottaaw</td></tr><tr><td>2</td> <td>Elon</td> <td>Mars</td></tr><tr><td>3</td> <td>Jeff</td> <td>Orbit</td></tr><tr><td>4</td> <td>Klay</td> <td>Oakland</td></tr><tr><td>5</td> <td>Lebron</td> <td>Los Angeles</td></tr></tbody></table><p><small>図1.1 ディスクから簡単に素早く呼び出せる小さなテーブル</small></p> <p>基礎となるデータは、ストレージ全体に無秩序に分散され、感知できるほどにランダムに割り振られます。現在、ほとんどの本番サーバにはSSDが搭載されていますが、(HDD)回転ディスクが必要な場合もありますが、正直なところ、SSDの価格が大幅に下がってきているので、その理由は少なくなっています。</p> <blockquote class=\"tweet\"><p><b>SSDとHDD</b></p><p>ソリッド・ステート・ドライブ(SSD)とハードディスク・ドライブ(HDD)の主な違いは、データの保存とアクセスの方法です。HDDは機械的な回転ディスクと移動する読み取り/書き込みヘッドを使用してデータにアクセスします(待ち時間)。一方、SSDは特に多くの小さなファイルを読み取る際に、はるかに高速なメモリチップを使用します。 したがって、価格が問題でなければ、SSDの方が適しています。特に、最新のSSDはHDDとほぼ同等の信頼性があるためです。</p></blockquote> <p>このように、少量のデータをメモリに読み込むのは非常に高速で、スキャンも比較的簡単です。さて、もし検索するデータを完全にメモリにキャッシュできない場合はどうでしょうか? あるいは、ディスクからすべてのデータを読み取るのに時間がかかり過ぎる場合はどうでしょうか?</p> <table><tbody><tr><td>id</td> <td>name</td> <td>city</td></tr><tr><td>1</td> <td>Mahdi</td> <td>Ottaaw</td></tr><tr><td>2</td> <td>Elon</td> <td>Mars</td></tr><tr><td>3</td> <td>Jeff</td> <td>Orbit</td></tr><tr><td>4</td> <td>Klay</td> <td>Oakland</td></tr><tr><td>5</td> <td>Lebron</td> <td>Los Angeles</td></tr><tr><td>...</td> <td>...</td> <td>...</td></tr><tr><td>1000000</td> <td>Steph</td> <td>San Francisco</td></tr><tr><td>1001000</td> <td>Linus</td> <td>Portland</td></tr></tbody></table><p><small>図1.2大きなテーブルがメモリに完全には収まらず、ディスク全体に分散している</small></p> <p>そこで、ほとんどの開発者はここに行き着きます。私は、以前にこの問題を経験したことがあります。必要なデータがそこにあるかどうかを確認するために、低速ディスクをスキャンせずに、探している特定の行に到達する方法と、何らかの辞書(ハッシュマップ)が必要なのです。</p> <p><p>これらはインデックス・リーフノードと呼ばれ、インデックスを作成する特定の列が与えられると、一致する行の位置を格納することができます。</p> <div class=\"separator\" style=\"clear: both;\"><img alt=\"\" border=\"0\" height=\"500\" width=\"500\" src=\"https://blogger.googleusercontent.com/img/b/R29vZ2xl/AVvXsEh_eTXea4DSXlmwn9ujS9PhUdj2HWTxPzAlvS-S9jsbUVVYMxG8jTlPNWUH-dcHyjQWOxMPxzddqAWSdruBCr2hFvx4ooXpkVMMzCCQ39Hoqfe0kyP812cQS0JKMbZFsJKSAFRBYH-ALv6Cxkc_BbdmTxpZuFzJYE4T2Fiersa6E6XOQk8x_s1GcKQUKg/s1600/Databases-02-1.jpg\"/></div> <p>これらのインデックス・リーフノードは、インデックス付きの列と、対応する行がディスク上のどこに存在するかのマッピングです。これにより、インデックス付きの列で特定の行を参照する場合、特定の行にすばやくアクセスすることができるようになります。インデックスのスキャンは、検索対象の列をコンパクトな表現(バイト数が少ない)であるため、高速に行うことができます。要求されたデータを探して多くのブロックを読み取る時間を節約でき、キャッシュするのも便利なので、さらに全体の処理が高速化されます。</p> <p>データの規模が大きいと不利に働くことがよくありますが、平衡木(バランスツリー)はそのような事態に対処するための最初のツールです。</p> <p>これらのインデックス・リーフノードは均一なサイズで、ブロックごとにできるだけ多くのリーフノードを格納しようとしています。この構造では、データを(物理的なディスク上ではなく、論理的に)ソートする必要があるため、データの追加と削除を迅速に行うという問題を解決する必要があります。この問題を解決するのが、古き良き時代のリンクリスト、より具体的には二重リンクリストです。</p> <blockquote class=\"tweet\"><p><b>ブロック</b></p><p>コンピュータの利用では、ブロックは通常、固定数のレコードを含むバイトのグループで、合計長(ブロック長)によって制限されています。つまり、1行を格納するのに必要なバイト数をブロック長で割ると、特定のブロックから何行読み取ることができるかが分かるというわけです。</p><p>非常に低いレベルではありますが、これを利用して、システムの性能を推測することができます。Quick Maths™は、容量計画を行う際に非常に有効です。</p></blockquote> <p>この利点は2つあります。インデックス・リーフノードを前方にも後方にも読み取ることができることと、ポインタを変更するだけなので、新しい行を削除したり追加したりする際にインデックス構造を素早く再構築できることです。</p> <blockquote class=\"tweet\"><p><b>リンクリスト</b></p><p>リンクリストは、データ要素の線形コレクションで、その順序はメモリ内の物理的な配置によって与えられるものではありません。その代わり、各ピースは次のピースを指します。これは、シーケンスを表すノードの集まりを一緒にしたデータ構造です。最も基本的な形式では、各ノードにはデータと次のノードへの参照(つまり、リンク)が含まれます。</p></blockquote> <p>これらのリーフノードは物理的にディスク上に順番に配置されているわけではないため(ポインタは二重リンクリストのソートを維持することを忘れないで下さい)、正しいインデックス・リーフノードに到達する方法が必要です。</p> <h4>バランス・ツリー(Bツリー)</h4> <div class=\"separator\" style=\"clear: both;\"><img alt=\"\" border=\"0\" height=\"117\" width=\"500\" src=\"https://blogger.googleusercontent.com/img/b/R29vZ2xl/AVvXsEhsAY0A9sKMU2GMlPYCyOQ1jO5Fs1DLgzyD4Wn1pJJe8N7ugQFvhS7cHSeteiL2Pu0fHPMWKI6VRX5LJpaIO8AGG75KWbhm4O-NOKrh1KC_K4QE2JWCKslehAXc06FFBjVJMUCrODEErSO0bzdnvrav_eIPouONMTGuUrXa3_f6_CCD17e6rDT1K9FA3w/s1600/Databases-06-3.jpg\"/></div><p><small>BツリーとB+ツリーの構造上の違い</small></p> <p>学校時代に大嫌いだったBツリーを読むなんて、どこで間違えたんだろうと思うかも知れません。これらは退屈だと思いますが、強力で理解する価値があります。</p> <p>B+ツリーは、各中間ノードがそれぞれのリーフノードの最高のノード値を指すようなツリー構造を構築することができます。これにより、必要なデータを指すインデックスのリーフノードを見つけるための明確なパスが得られます。</p> <p>この構造は、中間ノードが最上部のルートノードに到達するまですべてのリーフノードをカバーするように、下から上に構築されています。このツリー構造は、深さがツリー全体で均一であることから、バランス型と呼ばれるようになりました。</p> <blockquote class=\"tweet\"><p><b>BツリーとB+ツリー</b></p><p>B+ツリーがアピールする主な違いは、中間ノードにデータが保存されないことです。その代わり、すべてのデータ参照がリーフノードにリンクされているため、ツリー構造のキャッシュをより良くすることができます。</p><p>次に、リーフノードがリンクされているので、インデックススキャンを行う必要がある場合、ツリー全体を上下に移動してディスクからさらにインデックスデータをロードするのではなく、1回の線形パスを行うことができます。</p></blockquote> <div class=\"separator\" style=\"clear: both;\"><img alt=\"\" border=\"0\" height=\"395\" width=\"500\" src=\"https://blogger.googleusercontent.com/img/b/R29vZ2xl/AVvXsEjd-Yz2J5f_6d5ieXdBIOTjrAnudmDPwDm_WZ84GqceR0BDa-CsG-BpCnaoTvZCE-ERjL0bCgOvuciu_IMPwEYLofvekl8GDA2FunpisbaibkVFPyt4_yFQiogKpk9gvETOVn6nsKcNR9teQE-jYIugv1RilIjnBGjbYAFyRFncwm3zAvYq3UbJg5StqQ/s1600/Databases-03-3.jpg\"/></div><p><small>RDBMSにおけるB+ツリーの使われ方</small></p> <h4>対数的スケーラビリティ</h4> <p>ここで少し余談ですが、この構造の威力を実感していただきたいと思います。もちろん、ほとんどの開発者はデータの指数関数的な増加、そして理想的には企業の評価について知っています。しかし、残念ながら、データの規模はしばしば不利に働き、バランスの取れたツリーはそれに対する最初の武器となるのです。</p> <p>中間ノードが参照できるアイテムの数(M)とツリー全体の深さ(N)に応じて、MからN個のオブジェクトを参照することができます。</p> <p>以下は、Mの値が5とした場合の概念を示す表です。</p> <table><tbody><tr><td>Tree Height(N)</td> <td>Index Leaf Nodes</td></tr><tr><td>3</td> <td>125</td></tr><tr><td>4</td> <td>625</td></tr><tr><td>5</td> <td>3125</td></tr><tr><td>6</td> <td>15625</td></tr><tr><td>7</td> <td>78125</td></tr><tr><td>8</td> <td>390625</td></tr><tr><td>9</td> <td>1953125</td></tr></tbody></table> <p>そのため、インデックスのリーフノードの数が指数関数的に増加しても、ツリーの高さはインデックスリーフノードの数に対して驚くほどゆっくりと(対数的に)増加します。このようにツリーの高さをバランスよく調整することで、ディスク上の実際のデータを指す関連するインデックスのリーフノードをほぼ瞬時に特定することができます。</p> <p>この光景は美しいと思いませんか!</p> <h3>トランザクションとは何か?</h3> <p>トランザクションは、1つの単位として扱いたい仕事の単位です。したがって、トランザクションは完全に発生するか、まったく発生しないかのどちらかでなければなりません。ほとんどのシステムはトランザクションを手動で管理する必要はないと私は主張しますが、柔軟性の向上が目的の効果を達成するのに役立つ状況もあります。トランザクションは主にACIDのIである独立性(Isolation)を扱います。</p> <blockquote class=\"tweet\"><p><b>ACIDとは何ですか？</b></p><p>コンピューターサイエンスにおいて、ACID(アトミック性、一貫性、独立性、耐久性)は、エラー、電源障害、その他の事故が発生した場合でもデータの有効性を保証することを目的としたデータベース・トランザクションの一連の特性です。</p><ul><li>アトミック性(不可分性)を保証することで、データベースへの更新が部分的にしか行われないことを防ぎ、一連の更新を全面的に拒否するよりも重大な問題を引き起こす可能性があります。</li><li>一貫性は、トランザクションがデータベースをある有効な状態から次の状態に移行できることを保証するものです。 これは、これらすべてが定義されたすべてのデータベース規則に準拠することを保証します。また、不正なトランザクションによる破損も防止します。</li><li>独立性は、特定のアクションが他の同時実行システムのユーザにどのように表示されるかを決定するものです。</li><li>耐久性は、コミットされたトランザクションが永続的に存続することを保証する性質です。</li></ul><p>これらの概念は一般的によく理解されていますが、データベース・システムによっては、システム間で定義が一貫していない場合があります。そのため、実稼働中のデータベースについては、それぞれについて必ず読んでおくようにして下さい。</p></blockquote> <p>これらは自動的に実行されるため、意識することはありませんが、次のように手動で作成することもできます。</p> <pre class=\"console\"><br />-- Manual transaction with commit. <br />BEGIN;<br />SELECT * FROM people WHERE id =1;<br />COMMIT or ROLLBACK;<br /></pre><p><small>図1.3手動トランザクションを作成する方法。</small></p> <p>BEGINからCOMMITまたはROLLBACKまでの時間と、同じデータに対して作用する他の様々なトランザクションに何が起こるかに注目します。</p> <blockquote class=\"tweet\"><p><b>コミット/ロールバック</b></p><p>すべての手動トランザクションは、COMMITまたはROLLBACKが成功した時点で終了します。</p><ul><li>COMMITの耐久性は、現在のトランザクションで行われた変更を持続させます。</li><li>ROLLBACKは、現在のトランザクションで行われた変更を元に戻します。</li></ul><p>手動でトランザクションを管理していない場合、トランザクション内のすべてのクエリが正常に完了すると、それらはコミットされます。障害が発生した場合、そのトランザクション中の変更はロールバックされ、アクション全体のアトミック性が保証されます。</p></blockquote> <h4>読み出し現象</h4> <p>これらの独立性では、いくつかの読み取り現象が発生する可能性があり、それらを理解することは、システムのデバッグや、システムがどのような不整合を許容できるかを本当に理解するためには不可欠です。</p> <p><b>繰り返し不可の読み取り</b></p> <div class=\"separator\" style=\"clear: both;\"><img alt=\"\" border=\"0\" height=\"535\" width=\"500\" src=\"https://blogger.googleusercontent.com/img/b/R29vZ2xl/AVvXsEh_PtwLUnYZJIxIQqnaEZbS9R6hi5yinZaJAUk_8RzgFTLnGqB23u3esHDji8CGMlajqcfcTJT7vgiGDJr181YfZBUD76HjAsLw_dGg_-eIVuAp_tOb5VKYFAH-Cw2nnDe3JT2tMsZ78mLbixMo4T0ydZDuDuxMvDWElG--WTneX0dv7dgvO_9dIsBjUg/s1600/Databases-08.jpg\"/></div><p><small>繰り返し不可の読み取りの例</small></p> <p>上の画像のように、トランザクション中に後続の2つの読み取り間でデータの一貫したビューを取得できない場合、繰り返し不可の読み取りが発生します。特定のモードでは、同時にデータベースを変更することが可能であり、読み取ったばかりの値が変更される可能性があり、その結果、繰り返し不可の読み取りが発生うるシナリオがあり得ます。</p> <p><b>ダーティな読み取り</b></p> <div class=\"separator\" style=\"clear: both;\"><img alt=\"\" border=\"0\" height=\"515\" width=\"500\" src=\"https://blogger.googleusercontent.com/img/b/R29vZ2xl/AVvXsEiWzFPNFd6T5YeY-_NbmtkOKeS5vWzcvtf9JN-DgwbbT0OPausfWs4djAnXm-OSBOGtGM2G8qvSTPSLbBVHQT8uyOvzQ_7Rtvckbaxxyd159YmfL9OF1uIPZkn8-y3SFBq7p8-PvsJcdlInz6daradjzAnH4HQ5vlE7UyHI6q9-mMd5qsJusdYLRL5lTw/s1600/dirty-reads.png\"/></div><p><small>ダーティな読み取りの例</small></p> <p>同様に、ダーティな読み取りは、読み取りを実行した後、別のトランザクションが同じ行を更新したが、その作業をコミットしなかった場合に発生します。別の読み取りを実行すると、コミットされていない(ダーティ)値にアクセスできますが、これは耐久性のある状態変更ではなく、データベースの状態と矛盾しています。</p> <p><b>ファントム読み取り</b></p> <div class=\"separator\" style=\"clear: both;\"><img alt=\"\" border=\"0\" height=\"611\" width=\"500\" src=\"https://blogger.googleusercontent.com/img/b/R29vZ2xl/AVvXsEj4HNnhHCsgbuiHCm0Y7BIr564ZM3cCXMbO3RfGzQxtzd6BzavJqfhn-fYw9nnZvhl1tiS9cB0TQQD847aE_bUCipm-ryO8IyPM5ea4hs9MUoVpD-nxZYVzcPlrqdXuT322XSyAWFA1hy2CHcgZ8wP566TK7E-KXgwZGVBgjAWL7jlw42lHWymfF4KqNw/s1600/Databases-10.jpg\"/></div><p><small>ファントム読み取りの例</small></p> <p>ファントム読み取りは、コミットされた読み取りのもう一つの現象で、最も一般的に集計を処理しているときに発生します。例えば、特定のトランザクションで顧客の数を尋ねるとします。この2回の読み取りの間に、別の顧客が自分のアカウントにサインアップしたり、削除したりします(コミット済み)。これにより、データベースがこれらのトランザクションの範囲ロックをサポートしていない場合、2つの異なる値を取得することになります。</p> <blockquote class=\"tweet\"><p><b>範囲ロック</b></p><p>範囲ロックは、考えられるすべてのロックレベルを示すことによって、最もよく説明されます。</p><ol><li>シリアル化されたデータベースアクセス — データベースにクエリを1つずつ実行させる — ひどい同時実行性ですが、一貫性は最高レベルです。</li><li>テーブルロック — トランザクションのテーブルをロックし、同時実行性は若干向上しますが、テーブルへの同時書き込みは依然として遅くなります。</li><li>行ロック — 作業中の行をロックし、テーブルロックよりも並行性は高くなりますが、複数のトランザクションでこの行を必要とする場合、それらの行は待機する必要があります。</li></ol><p>範囲ロックは、最後の2つのレベルのロックの中間です。トランザクションで取り込んだ値の範囲をロックし、トランザクションで取り込んだ範囲内での挿入や更新を許可しないようにします。</p></blockquote> <h4>独立性レベル</h4> <div class=\"separator\" style=\"clear: both;\"><img alt=\"\" border=\"0\" height=\"332\" width=\"500\" src=\"https://blogger.googleusercontent.com/img/b/R29vZ2xl/AVvXsEhuCJOr9Xb8hO86guAD7PgIHHz2yE4hexpW3zA16mBujVGj__HYB-zjWmMBOfEkcU2kAKVYi4yBEXDd6Ba5g-Otst5MqVQhInoFo_BvZeZr4pwnjxkyS7wqNjDvi0Z7oRiQKn_iu8U7Gikq9WKAUSY38Hy48wOVxfj-XArhjqaGxihGtkAifh3uSED5vQ/s1600/Databases-05-2.jpg\"/></div><p><small>4SQL標準の独立性レベル</small></p> <p>標準SQLでは、4つの標準的な独立性レベルが定義されており、これらはグローバルに設定することができますし、またそうすべきです(独立性レベルについて信頼性のある推論が出来なければ、知らぬ間に進行する事態が起こる可能性があります)。</p> <h4>繰り返し読む</h4> <p>まずは、REPEATABLE READから始めましょう。これを理解するのは比較的簡単で、残りの独立性レベルのためのテーブルを設定します。この独立性レベルは最初の読み取りによって確立されたトランザクションの中で一貫した読み取りを保証します。このビューはいくつかの方法で維持されます。あるものはシステム全体の性能に影響し、あるものは影響しませんが、この記事の範囲外です。</p> <p>上の図を参照して下さい。一旦、最初の読み取りを行うと、そのビューはトランザクションの期間中ロックされるため、このトランザクションのコンテキスト外で起こることは、コミットされているかどうかに関係なく、何の結果も生じません。</p> <p>この独立性レベルは、いくつかの既知の独立性問題、主に繰り返し不可能でダーティな読み取りから私たちを保護してくれます。しかし、データベースの特定のビューにロックされている間は、マイナーなデータの不整合が発生します。このレベルでは、トランザクションを可能な限り短期間で終了させることが有益です。</p> <h4>シリアル化可能</h4> <p>この動作モードは、一度に1つのクエリしか実行できないため、最も制限が厳しく、一貫性のある動作モードと言えます。</p> <p>データベースがクエリを1つずつ実行し、安定した状態から次の状態へと遷移するため、すべてのタイプの読み取り現象が発生することはなくなります。このあたりはニュアンスが異なりますが、ほぼ正確です。</p> <p>このモードでの注意点は、同時実行の問題が原因でクエリが失敗する可能性があるため、何らかの再試行メカニズムを持つことが不可欠です。</p> <p>最近の分散データベースは一貫性を保証するためにこの独立性レベルを利用しています。<a href=\"https://www.cockroachlabs.com/\">CockroachDB</a>はそのようなデータベースの例です。一見の価値があります。</p> <h4>コミット済みの読み取り</h4> <p>この独立性モードはREPEATABLE READとは異なり、各読み取りがそれぞれ一貫した(コミット済み)時間のスナップショットを作成します。その結果、この独立性モードは、同じトランザクション内で複数の読み取りを実行すると、ファントム読み取りの影響を受けやすくなります。</p> <h4>コミットされていない読み取り</h4> <p>別の方法として、READ UNCOMMITTED独立性レベルはトランザクション・ロックを維持しないため、コミットされていないデータをそのまま見ることができ、ダーティー読み取りに繋がります。これは悪夢のようなものです…いくつかのシステムにとっては。</p> <p>簡単でしょ、データベースについて知っておくべきこと</p> <p>もし、これを楽しんで頂けたなら、私たちはこのようなコンテンツをもっとたくさん用意しています! このような細かいニュアンスのトピックを理解しやすくし、どこでどのようなことに遭遇するのかを強調するよう努めています!</p> <p>サインアップするか、この記事を読んで役に立ちそうな方とシェアしていただければ、本当にありがたいです。</p> <p>フィードバックは大歓迎です。Twitterの@<a href=\"https://twitter.com/myusuf3\">myusuf3</a>までお願いします。</p> <h3>参考文献</h3> <ul><li><a href=\"https://ja.wikipedia.org/wiki/%E9%96%A2%E4%BF%82%E3%83%87%E3%83%BC%E3%82%BF%E3%83%99%E3%83%BC%E3%82%B9\">リレーショナル・データベース</a> - ウィキペディア, ウィキメディア財団, ウィキメディアプロジェクトへの貢献者</li><br> <li><a href=\"https://blog.jcole.us/2013/01/10/btree-index-structures-in-innodb/\">InnoDBのB+ツリーインデックス構造</a>: [この投稿は、2014年2月3日時点のinnodb_rubyバージョン0.8.8を参照しています。] InnoDBの学習について: コアへの旅で、InnoDBの内部を文書化するinnodb_diagramsプロジェクトを紹介しました。ジェレミー・コール, ジェレミー・コール</li><br> <li><a href=\"https://ja.wikipedia.org/wiki/ACID_(%E3%82%B3%E3%83%B3%E3%83%94%E3%83%A5%E3%83%BC%E3%82%BF%E7%A7%91%E5%AD%A6)\">ACID</a> - ウィキペディア, ウィキメディア財団, ウィキメディアプロジェクトへの貢献者</li><br> <li><a href=\"https://www.cockroachlabs.com/docs/stable/demo-serializable.html\">シリアル化可能なトランザクション</a> | CockroachDBドキュメント: データの正しさのためのSERIALIZABLE独立性の重要性を示すデモに従って下さい, CockroachDBドキュメント</li><br> <li><a href=\"https://use-the-index-luke.com/sql/preface\">SQLデータベースに適切なインデックスを追加しなければならないのは誰か?</a>: データベースのインデックスは、クエリに適合していなければなりません。したがって、クエリを書いている人が行う必要があります。</li><br> <li><a href=\"https://ja.wikipedia.org/wiki/%E3%83%88%E3%83%A9%E3%83%B3%E3%82%B6%E3%82%AF%E3%82%B7%E3%83%A7%E3%83%B3%E5%88%86%E9%9B%A2%E3%83%AC%E3%83%99%E3%83%AB\">独立性(データベースシステム)</a> - ウィキペディア, ウィキメディア財団, ウィキメディアプロジェクトへの貢献者</li><br> <li><a href=\"https://www.sqlshack.com/snapshot-isolation-in-sql-server/\">SQL Serverにおけるスナップショットの独立性</a>: この記事では、従来のANSI SQLトランザクション・レベルの代替として、行のバージョン管理を使用したスナップショットの独立性の使用方法を探ります, SQL Shack - データベース監査、サーバーパフォーマンス、データリカバリなどに関する記事</li></ul></blockquote><p><a href=\"https://news.ycombinator.com/item?id=31895623\">Hacker News</a></p> <p>Article URL: <a href=\"https://okuranagaimo.blogspot.com/2022/07/blog-post_67.html\">https://okuranagaimo.blogspot.com/2022/07/blog-post_67.html</a></p> </blockquote>","date_published":"2022-07-04T09:44:25.886Z"},{"id":"https://okuranagaimo.blogspot.com/2022/07/blog-post_4.html","url":"https://okuranagaimo.blogspot.com/2022/07/blog-post_4.html","title":"客観的な現実はまったく存在しないかもしれない、と量子物理学者は指摘する","content_html":"<blockquote> <p><a href=\"https://okuranagaimo.blogspot.com/\">ブログ</a> <strong>客観的な現実はまったく存在しないかもしれない、と量子物理学者は指摘する</strong></p> <p>by Unknown <i>#Science</i></p> <p><a href=\"https://www.popularmechanics.com/science/a40460495/objective-reality-may-not-exist/\">ポピュラー・メカニクスより</a>。</p><blockquote class=\"ref\"><p>新しい研究によると、現実は「観察者の目の中にある」かも知れない</p> <p>BY スタヴ・ディミトロポウロス</p> <ul><li><a href=\"https://www.popularmechanics.com/science/a32209316/quantum-steampunk-physics/\">量子力学</a>における最大の謎の一つは、物理的現実が観察者から独立して存在するかどうかということ。</li><li>ブラジルからの<a href=\"https://go.redirectingat.com/?id=74968X1525083&url=https%3A%2F%2Fwww.nature.com%2Farticles%2Fs42005-022-00828-z&sref=https%3A%2F%2Fwww.popularmechanics.com%2Fscience%2Fa40460495%2Fobjective-reality-may-not-exist%2F&xs=1&xcust=%5Butm_source%7C%5Butm_campaign%7C%5Butm_medium%7C%5Bgclid%7C%5Bmsclkid%7C%5Bfbclid%7C%5Brefdomain%7C%5Bcontent_id%7C99b6f2a6-cc89-4180-a17e-c96ce09f5b0d%5Bcontent_product_id%7Ca6a0f445-fb95-4716-b43c-5e1452431414%5Bproduct_retailer_id%7C\">新しい研究</a>により、量子の世界には互いに排他的でありながら補完的な物理的<a href=\"https://www.popularmechanics.com/technology/gadgets/a39728709/metaverse-social-platforms-connection/\">現実</a>が存在する可能性を示す強力な証拠が示された。</li><li>今後、この量子力学の大論争の研究が進めば、超破壊的な<a href=\"https://www.popularmechanics.com/science/energy/a38560856/teaching-quantum-materials-how-to-remember/\">量子技術</a>や、世界最大の謎に対する驚くべき答えが得られるかも知れない。</li></ul> <hr> <p>現実は存在するのか、それとも<a href=\"https://www.popularmechanics.com/science/a36633457/wigners-friend-paradox/\">観察者が測定する</a>ことによって形作られるのか? 誰もいない森で木が倒れたら、音が鳴るかどうか、という古くからの難問と同様、この問いは、ミクロの世界での<a href=\"https://www.popularmechanics.com/science/a31262444/particle-decay-new-physics/\">素粒子</a>の振る舞いを扱う量子力学の分野で最も興味をそそられるものの一つである。</p> <p>1つの<a href=\"https://www.popularmechanics.com/science/a40432968/dead-cone-effect/\">粒子</a>が同時に2つ、あるいは「すべての」場所に存在することができる<a href=\"https://www.popularmechanics.com/science/a39785072/time-might-not-exist-at-all-some-scientists-say/\">「量子の重ね合わせ」のような不思議な現象</a>が支配的なこの分野で、現実は自分の意識の外に存在し、それを変えることはできない、という専門家がいる。また、「量子的現実」は、自分の行動によって様々な形に成形される「プレードウ」のようなものだと主張する専門家もいる。ブラジルのサンパウロ大都市圏にあるABC連邦大学(UFABC)の科学者たちは、現実は「観察者の<a href=\"https://www.popularmechanics.com/science/a39024288/vision-15-seconds-in-the-past/\">目</a>の中にある」かもしれないという説に新たな燃料を投じた。</p> <p>ブラジルの科学者は、4月に学術誌「<a href=\"https://go.redirectingat.com/?id=74968X1525083&url=https%3A%2F%2Fwww.nature.com%2Farticles%2Fs42005-022-00828-z&sref=https%3A%2F%2Fwww.popularmechanics.com%2Fscience%2Fa40460495%2Fobjective-reality-may-not-exist%2F&xs=1&xcust=%5Butm_source%7C%5Butm_campaign%7C%5Butm_medium%7C%5Bgclid%7C%5Bmsclkid%7C%5Bfbclid%7C%5Brefdomain%7C%5Bcontent_id%7C99b6f2a6-cc89-4180-a17e-c96ce09f5b0d%5Bcontent_product_id%7Ca6a0f445-fb95-4716-b43c-5e1452431414%5Bproduct_retailer_id%7C\">Communications Physics</a>」に発表した新しい研究で、デンマークの著名な物理学者ニールス・ボアが1928年に提唱した「相補性の原理」を検証しようと試みた。これは、物体は、エネルギーと持続時間、位置と運動量のように、同時に観察したり測定したりすることは不可能な、ある対の相補的な性質を備えている<a href=\"https://www.sciencedirect.com/science/article/abs/pii/0039368192900296\">というものである</a>。例えば、一対の電子を扱う実験では、どのように設定しても、両方の量の位置を同時に調べることはできない。テストでは、最初の電子の位置が示される、同時に2番目の粒子(相補粒子)の位置は不明瞭になる。</p> <h3>「神はサイコロを振らない」</h3> <p>この相補性原理と客観的現実との関係を理解するためには、約1世紀前の歴史にさかのぼる必要がある。1927年にブリュッセルで開催れた第5回<a href=\"https://go.redirectingat.com/?id=74968X1525083&url=https%3A%2F%2Fwww.nature.com%2Farticles%2Fd41586-018-03793-2&sref=https%3A%2F%2Fwww.popularmechanics.com%2Fscience%2Fa40460495%2Fobjective-reality-may-not-exist%2F&xs=1&xcust=%5Butm_source%7C%5Butm_campaign%7C%5Butm_medium%7C%5Bgclid%7C%5Bmsclkid%7C%5Bfbclid%7C%5Brefdomain%7C%5Bcontent_id%7C99b6f2a6-cc89-4180-a17e-c96ce09f5b0d%5Bcontent_product_id%7C0633a647-e4ba-4325-bf2e-1a0400241d7b%5Bproduct_retailer_id%7C\">ソルベイ会議</a>(物理学と化学の最も重要な年次国際会議)で、<a href=\"https://www.popularmechanics.com/science/a22995/quantum-entanglement-video-explainer/\">ボーア</a>とドイツ生まれの著名な理論物理学者アルバート・アインシュタインの間で伝説的な論争が行われた。</p> <div class=\"separator\" style=\"clear: both;\"><img alt=\"\" border=\"0\" height=\"442\" width=\"320\" src=\"https://blogger.googleusercontent.com/img/b/R29vZ2xl/AVvXsEhimBKwdqXvz39jwcb_cNk6ROl4L8z7vKMwhiNkIar3Ts-jR1GBKwsCn4xzxbpAr2BZWRFUubcKHh73BshXKcH3fMXy8M6FLLCJZZRSJxTHTQ4r3orqnQd44S2UJSFoYJ96Wf2S1lBbHCFUxkWZRgKX7Auez_ysLyHqcE8ISv0rizxtGGz3IFpDXmqFFw/s1600/physicists-einstein-and-bohr-both-worked-on-quantum-theory-news-photo-1656524902.jpg\"/></div><p><small>タバコを吸うアルバート・アインシュタイン(右)とニールス・ボーア(左)、1920年頃。共に量子論の研究を行なっていた。アインシュタインは1900年から1916年にかけて相対性理論を発展させ、1921年にノーベル物理学賞を受賞した。ボーアは原子の電子構造の研究に取り組み、「対応原理」(1916)と「相補原理」(1927)を開発した。ボーアは1922年にノーベル賞を受賞した。SCIENCE & SOCIETY PICTURE LIBRARYGETTY IMAGES</small></p> <p>量子論の初期の分野について議論するためにオーストリアの首都に集まった77人の優秀な科学者が見守る中、<a href=\"https://www.popularmechanics.com/science/math/a29677190/einstein-eclipse-anniversary/\">アインシュタイン</a>は量子状態には、科学者がどのように作用するかとは無関係に、独自の現実を持っていると主張した。一方、ボーアは、量子系は科学者が実験計画を立ててから出ないと、独自の現実を定義することはできないと弁明した。</p> <p>アインシュタインは「神はサイコロを振らない」と言った。</p> <p>ボーアは、「ある系は、状況に応じて波としても粒子としても振る舞うが、どちらがそうなるかは予測することはできない」と主張し、物質はある瞬間に波として、別の瞬間に粒子として現れる可能性があるという<a href=\"https://interestingengineering.com/louis-broglie-and-the-idea-of-wave-particle-duality\">粒子と波動の二重性</a>という概念を示した。これは、フランスの物理学者<a href=\"https://www.popularmechanics.com/space/a24114/pilot-wave-quantum-mechanics-theory/\">ルイ・ド・ブロイ</a>が1924年に提唱した概念である。</p> <h3>「相補性原理」</h3> <p>1927年のソルベイ会議の終了後、ボーアが相補性<a href=\"https://ui.adsabs.harvard.edu/abs/1987FoPh...17..461M/abstract\">原理を公言する</a>のにそれほど時間はかからなかった。その後数十年にわたり、物議を醸したボーアの概念は、骨の髄まで検証されることになる。相補性原理の実験を行った一人に、アメリカの理論物理学者ジョン・アーチボルト・ホイーラーがいた。</p> <p>ホイーラーは、1801年にトーマス・ヤングが行った<a href=\"https://www.aps.org/publications/apsnews/200805/physicshistory.cfm\">二重スリット実験</a>を、1978年に光の性質を再解釈することを試みた。<a href=\"https://www.popularmechanics.com/science/a22280/double-slit-experiment-even-weirder/\">二重スリット実験</a>とは、平行な2本のスリットのある壁に光を当てるというものである。光はそれぞれのスリットを通過するとき、仕切りの向こう側で、もう一方のスリットからの光と回折して重なり合い、互いに干渉し合う。つまり、直線ではなくなるということである。実験の最後に現れるグラフのパターンは<a href=\"https://www.scienceabc.com/pure-sciences/double-slit-experiment.html\">干渉パターン</a>であり、光が波打つように動いていることを意味する。つまり、光には粒子と波の性質があり、この2つの性質は切り離すことはできない。</p> <p>ホイーラーは、光がすでに機械の大部分を通過した後で、「波動測定器」と「粒子測定器」の間で切り替えた。つまり、光が波として伝播してきたのか、粒子として伝播しているのかの選択を遅れせたところ、選択を遅らせた後でも、相補性の原理に違反しないことを発見した。</p> <p>しかし、<a href=\"https://www.science.org/doi/10.1126/sciadv.1603159\">最近の研究では</a>、量子重ね合わせの原理を遅延選択実験に適用しようとすると、2つの可能性が共存していることが分かった(ちょうど、湖の表面にある2つの<a href=\"https://www.popularmechanics.com/science/a39744526/these-sound-waves-could-make-you-feel-high-scientists-say/\">波</a>が重なることがあるように)。これは、相補性の原理に反して、同じ装置内で波動的な振る舞いと粒子的な振る舞いが混在していること示唆している。</p> <h3>量子制御された現実</h3> <p>ブラジルの科学者たちは、量子制御された現実の実験も設計することにした。</p> <p>この実験を主導したUFABCの量子情報科学技術研究者の<a href=\"https://www.rmserra.org/\">ロベルト・M・セラ</a>は、「私たちは、医療用画像処理に用いられるものと同様の核磁気共鳴技術を使用しました」と、ポピュラー・メカニクスに語っている。陽子、中性子、電子などの粒子はすべて核スピンを持っており、これは、<a href=\"https://www.popularmechanics.com/adventure/outdoors/a28411555/how-to-use-a-compass/\">コンパス</a>の針の向きに類似した磁気特性である。「私たちは、一種の電磁放射を使って、分子内の様々な原子の核スピンを操作しました。この装置では、陽子の核スピン用の新しい干渉装置を作り、量子領域における波動と粒子の実態を調べました」とセラは説明する。</p> <p>「この新しい配置は、以前の量子遅延選択実験とまったく同じ観測統計量を生成しました」と、この研究に参加し、現在ポーランドの国際量子技術理論センター( ICTQT)のポスドク研究員である<a href=\"https://scholar.google.com.br/citations?user=noUZ2q4AAAAJ&hl=en\">ペドロ・ルアス・ディエゲス</a>は、ポピュラー・メカニクスに語っている。「しかし、新しい構成では、ボーアの相補性の原理を検証する方法で、実験結果を波と粒子の振る舞いに結び付けることができました」とディエゲスは続ける。</p> <p>2022年4月の研究から得られた主な成果は、量子の世界における物理的現実は、相互に排他的な存在でできており、それにもかかわらず、矛盾することなく、互いに補完し合っているということである。</p> <p>これは魅力的な結果であると専門家は述べている。「ブラジルの研究者らは、量子論の検証、特にシステムの物理的実在性の研究による相補性の性質の理解を可能にする数学的枠組みとそれに対応する実験構成を考案しました」とフォーダム大学の物理学准教授である<a href=\"https://www.fordham.edu/info/20721/faculty_and_staff/4398/stephen_holler\">スティーブン・ホラー</a>はポピュラー・メカニクスに語っている。</p> <p>アメリカの代表的な量子物理学者でノーベル賞受賞者のリチャード・ファインマンが<a href=\"https://www.bbc.com/future/article/20130124-will-we-ever-get-quantum-theory\">長年言い続けてきた</a>「量子力学を理解していると思うなら、量子力学を理解していない」という格言を浮き彫りにする研究である、とホラーは言う。「この理論について学ぶことはたくさんあります。研究者らはは基本原理さえも理解しようと前進し続けています。これは、量子デバイスと量子コンピュータが普及し始める時代に突入した今、特に重要なことです。」</p> <p>ディエゲスは意気揚々としている。「物質粒子が波のように振る舞い、光は粒子のように振る舞うという事実は、量子物理学の最も興味深く美しい謎の1つです」と彼は言う。</p> <p>逆説的だが、この量子力学特有の「奇妙さ」は非常に有益なものであることが分かる。「量子力学を解明されればされるほど、量子コンピュータ、量子暗号、量子センサー、量子熱デバイスなど、古典技術を凌駕する破壊的な量子技術を提供できるようになります」とセラは言う。</p> <p>現実が観察者の目に映るということは、量子領域における物理的現実の非常に特異な側面であり、その謎自体は一向に晴れる兆しを見せていない、と両研究者は同意する。</p></blockquote><a href=\"https://science.slashdot.org/story/22/07/02/2331223/objective-reality-may-not-exist-at-all-quantum-physicists-say\">Slashdot</a> <p>Article URL: <a href=\"https://okuranagaimo.blogspot.com/2022/07/blog-post_4.html\">https://okuranagaimo.blogspot.com/2022/07/blog-post_4.html</a></p> </blockquote>","date_published":"2022-07-04T05:33:20.906Z"},{"id":"https://www.hayakawabooks.com/n/nd2b6523e1576","url":"https://www.hayakawabooks.com/n/nd2b6523e1576","title":"【対談】戦争を書く、世界を書く。『同志少女よ、敵を撃て』逢坂冬馬×『地図と拳』小川哲","content_html":"<blockquote> <p><a href=\"https://www.hayakawabooks.com\">Hayakawa Books & Magazines</a> <strong>【対談】戦争を書く、世界を書く。『同志少女よ、敵を撃て』逢坂冬馬×『地図と拳』小川哲</strong></p> <p> </p> <p name=\"f66754e2-68cf-41f2-acce-cf7e0adb0d89\" id=\"f66754e2-68cf-41f2-acce-cf7e0adb0d89\">独ソ戦を題材とする第11回アガサ・クリスティー賞大賞受賞作<a href=\"https://amzn.to/3u5r1XA\" target=\"_blank\" rel=\"nofollow noopener\"><strong>『同志少女よ、敵を撃て』</strong></a>で2022年本屋大賞を受賞した<strong>逢坂冬馬</strong>氏と、第3回ハヤカワSFコンテスト出身で、日露戦争後の満州を描いた大作<a href=\"https://amzn.to/3u3W0n6\" target=\"_blank\" rel=\"nofollow noopener\"><strong>『地図と拳』</strong></a>が刊行になった<strong>小川哲</strong>氏。ともに海外・戦争を題材としてきた２氏による特別対談。SFマガジン8月号に掲載された本記事を、<a href=\"https://amzn.to/3OHavp8\" target=\"_blank\" rel=\"nofollow noopener\"><strong>『噓と正典』</strong></a>の文庫版発売を記念して特別公開します。</p><figure name=\"f38867e8-1260-412e-875b-a25d775dbfe9\" id=\"f38867e8-1260-412e-875b-a25d775dbfe9\" data-src=\"https://amzn.to/3OHavp8\" data-identifier=\"null\" embedded-service=\"external-article\" embedded-content-key=\"emb31e8bad90789\"> <a href=\"https://amzn.to/3OHavp8\" rel=\"nofollow noopener\" target=\"_blank\"><strong>嘘と正典 (ハヤカワ文庫JA)</strong><em></em><em>amzn.to</em> <em>924円</em>(2022年07月04日 11:46時点詳しくはこちら) Amazon.co.jpで購入する </a><a href=\"https://amzn.to/3OHavp8\" rel=\"nofollow noopener\" target=\"_blank\"></a> </figure><br/><a href='https://www.hayakawabooks.com/n/nd2b6523e1576'>続きをみる</a> <p>Article URL: <a href=\"https://www.hayakawabooks.com/n/nd2b6523e1576\">https://www.hayakawabooks.com/n/nd2b6523e1576</a></p> </blockquote>","date_published":"2022-07-04T03:02:01.000Z"},{"id":"https://wired.jp/article/32-bit-float-audio-explained/","url":"https://wired.jp/article/32-bit-float-audio-explained/","title":"音声録音のレベル調整が不要になる？ 新フォーマット「32bitフロート」について知っておくべきこと","content_html":"<blockquote> <p><a href=\"https://wired.jp\">最新情報 Feed – WIRED.jp</a> <strong>音声録音のレベル調整が不要になる？ 新フォーマット「32bitフロート」について知っておくべきこと</strong></p> <p> <i>#Audio</i> <i>#Film</i> <i>#Gear</i> <i>#Sound</i></p> 新しい音声録音フォーマット「32bitフロート」が、録音を始める前のレベル調整が不要になるという触れ込みで広まっている。途方もないダイナミックレンジの広さが特徴だが、これによりどんなメリットやデメリットが生じるのだろうか？ <p>Article URL: <a href=\"https://wired.jp/article/32-bit-float-audio-explained/\">https://wired.jp/article/32-bit-float-audio-explained/</a></p> </blockquote>","date_published":"2022-07-04T03:00:00.000Z"},{"id":"https://apple.srad.jp/story/22/07/03/1529254/","url":"https://apple.srad.jp/story/22/07/03/1529254/","title":"Apple、7月1日付で日本で大幅値上げ、最上位モデルでは最大4万円値上げ","content_html":"<blockquote> <p><a href=\"https://srad.jp/\">スラド</a> <strong>Apple、7月1日付で日本で大幅値上げ、最上位モデルでは最大4万円値上げ</strong></p> <p>by nagazou <i>#iphone</i></p> <img align=\"right\" height=\"64\" width=\"64\" src=\"https://srad.jp/static/topics/iphone_64.png\">7月1日にAppleが日本市場で「iPhone」を含む主要製品を日本で一斉に値上げした。iPhoneの場合、最大4万円の値上げとなっている。少し前に<a href=\"https://apple.srad.jp/story/22/06/16/1527250/\">日本のiPhone販売価格は世界最安</a>という話題を取り上げたことがあるが、円安事情なども踏まえて是正してきた模様（<a href=\"https://www.nikkei.com/article/DGXZQOGN30EV70Q2A630C2000000/\"> </a>、<a href=\"https://www.itmedia.co.jp/news/articles/2207/01/news069.html\">ITmedia</a>、<a href=\"https://k-tai.watch.impress.co.jp/docs/news/1421643.html\">ケータイ Watch</a>、<a href=\"https://gigazine.net/news/20220701-apple-increases-product-prices-japan/\">GIGAZINE</a>）。<br> <br> 報道によれば、従来は税込みで9万8800円からだったiPhone 13の価格は11万7800円からとなり、1万9000円高くなった。ITmediaの記事によれば、iPhone 13 Proの場合、これまで111円前後での為替価格だったのが、131円前後での為替価格に改定がされたという。ローエンド相当の「iPhone SE」も5000円値上げして6万2800円からとなった。それ以外にもタブレット端末「iPad」の価格は25％高い4万9800円からとなったほか、腕時計型端末「Apple Watch」も各機種をそれぞれ値上げした。<br> <br> PC系に関しては6月のWWDC22の発表後に日本のMac製品販売価格が値上げされていることから、今回の値上げには含まれていないという。<p> <a href=\"https://apple.srad.jp/story/22/07/03/1529254/\">すべて読む</a> | <a href=\"https://apple.srad.jp/\">アップルセクション</a> | <a href=\"https://srad.jp/stories/apple\">アップル</a> | <a href=\"https://srad.jp/stories/iphone\">iPhone</a> | <a href=\"https://srad.jp/stories/money\">お金</a> | <a href=\"https://twitter.com/share?url=https://apple.srad.jp/story/22/07/03/1529254/&text=Apple%E3%80%817%E6%9C%881%E6%97%A5%E4%BB%98%E3%81%A7%E6%97%A5%E6%9C%AC%E3%81%A7%E5%A4%A7%E5%B9%85%E5%80%A4%E4%B8%8A%E3%81%92%E3%80%81%E6%9C%80%E4%B8%8A%E4%BD%8D%E3%83%A2%E3%83%87%E3%83%AB%E3%81%A7%E3%81%AF%E6%9C%80%E5%A4%A74%E4%B8%87%E5%86%86%E5%80%A4%E4%B8%8A%E3%81%92\" title=\"この記事をTwitterでつぶやく\"><img alt=\"この記事をTwitterでつぶやく\" border=\"0\" src=\"//images.srad.jp/classic/img/twitter_32.png/20150127\" /></a> <a href=\"//www.facebook.com/sharer.php?u=https://apple.srad.jp/story/22/07/03/1529254/\" title=\"この記事をFacebookで共有\"><img src=\"//images.srad.jp/classic/img/facebook_32.png\" border=\"0\" alt=\"この記事をFacebookで共有\" /></a> <a href=\"https://plus.google.com/share?url=https://apple.srad.jp/story/22/07/03/1529254/\" title=\"この記事をGoogle Plusで共有\"><img src=\"https://www.gstatic.com/images/icons/gplus-32.png\" border=\"0\" alt=\"この記事をGoogle Plusで共有\" /></a> <a href=\"//b.hatena.ne.jp/entry/https://apple.srad.jp/story/22/07/03/1529254/\" title=\"このエントリーをはてなブックマークに追加\"><img src=\"https://b.st-hatena.com/images/entry-button/button-only@2x.png\" alt=\"このエントリーをはてなブックマークに追加\" width=\"32\" height=\"32\" style=\"border: none;\" border=\"0\" /></a> </p> <p> 関連ストーリー： <br><a href=\"https://hardware.srad.jp/story/22/06/29/1525217\">電気・ガス・ガソリン、航空会社の燃油サーチャージが値上げへ</a> <small>2022年06月30日</small> <br><a href=\"https://srad.jp/story/22/06/26/1542214\">カルビー、主要製品の価格改定へ。自助努力のみではコスト吸収が困難</a> <small>2022年06月27日</small> <br><a href=\"https://apple.srad.jp/story/22/06/16/1527250\">日本のiPhone販売価格は世界最安だった</a> <small>2022年06月17日</small> <br><a href=\"https://apple.srad.jp/story/22/06/07/1538257\">Apple、新 M2 チップと M2 チップを搭載する新 MacBook Air などを発表</a> <small>2022年06月08日</small> <br><a href=\"https://apple.srad.jp/story/22/05/19/1515223\">Apple、ユーザーの承諾なく自動更新サブスクリプションの価格を引き上げ可能に</a> <small>2022年05月20日</small> <br><a href=\"https://srad.jp/story/22/04/17/1849227\">ローソンのからあげクンが値上げ。36年目で初</a> <small>2022年04月19日</small> </p> <p>Article URL: <a href=\"https://apple.srad.jp/story/22/07/03/1529254/\">https://apple.srad.jp/story/22/07/03/1529254/</a></p> </blockquote>","date_published":"2022-07-04T03:00:00.000Z"},{"id":"https://applech2.com/archives/20220704-desktop-stand-for-apple-mac-studio.html","url":"https://applech2.com/archives/20220704-desktop-stand-for-apple-mac-studio.html","title":"Mac Studioを浮かせることで冷却性能を上げ、傷や埃から守るデスクトップスタンドや壁掛け用マウントが発売。","content_html":"<blockquote> <p><a href=\"https://applech2.com\">AAPL Ch.</a> <strong>Mac Studioを浮かせることで冷却性能を上げ、傷や埃から守るデスクトップスタンドや壁掛け用マウントが発売。</strong></p> <p> <i>#Mac Studio</i> <i>#Mac-mini</i> <i>#Mac-Studio</i> <i>#ケース</i></p> <div> <a href=\"https://applech2.com/archives/20220704-desktop-stand-for-apple-mac-studio.html\"><img title=\"CaSZLUTION-Mac-Studio-Stand-3-Hero\" src=\"https://applech2.com/wp-content/uploads/2022/07/Desktop-Stand-for-Apple-Mac-Studio-logo-icon.jpg\" alt=\"CaSZLUTION Mac Studio Stand\" width=\"256\" height=\"256\" /></a> </div> <p> Mac Studioを浮かせることで冷却性能を上げ、傷や埃から守るアクリル製のデスクトップスタンドや壁掛け用マウントが発売されています。詳細は以下から。 Appleが2022年03月より発売を開始した「Mac Stu</p> The post <a href=\"https://applech2.com/archives/20220704-desktop-stand-for-apple-mac-studio.html\">Mac Studioを浮かせることで冷却性能を上げ、傷や埃から守るデスクトップスタンドや壁掛け用マウントが発売。</a> first appeared on <a href=\"https://applech2.com\">AAPL Ch.</a>. <p>Article URL: <a href=\"https://applech2.com/archives/20220704-desktop-stand-for-apple-mac-studio.html\">https://applech2.com/archives/20220704-desktop-stand-for-apple-mac-studio.html</a></p> </blockquote>","date_published":"2022-07-04T02:25:47.000Z"},{"id":"https://www.axion.zone/24079462310-0-23/","url":"https://www.axion.zone/24079462310-0-23/","title":"ステーブルコインのテザー、空売りの渦に巻き込まれる","content_html":"<blockquote> <p><a href=\"https://www.axion.zone/\">アクシオン｜経済メディア</a> <strong>ステーブルコインのテザー、空売りの渦に巻き込まれる</strong></p> <p> <i>#暗号通貨</i></p> <img src=\"https://www.axion.zone/content/images/2022/07/-1x-1--6-.jpg\" alt=\"ステーブルコインのテザー、空売りの渦に巻き込まれる\"><p>(ブルームバーグ) -- 最大手のステーブルコイン、テザーの支持者は、トークンが十分な準備金に支えられ、円滑に機能していると繰り返し保証しているが、市場を安心させるには十分でない。</p> <p>Article URL: <a href=\"https://www.axion.zone/24079462310-0-23/\">https://www.axion.zone/24079462310-0-23/</a></p> </blockquote>","date_published":"2022-07-04T01:27:07.000Z"},{"id":"https://www.ralfj.de/blog/2022/07/02/miri.html","url":"https://www.ralfj.de/blog/2022/07/02/miri.html","title":"The last two years in Miri","content_html":"<blockquote> <p><a href=\"https://lobste.rs/\">Lobsters</a> <strong>The last two years in Miri</strong></p> <p>by sanxiyn@users.lobste.rs (sanxiyn) <i>#rust</i></p> <p><a href=\"https://lobste.rs/s/b6of8l/last_two_years_miri\">Comments</a></p> <p>Article URL: <a href=\"https://www.ralfj.de/blog/2022/07/02/miri.html\">https://www.ralfj.de/blog/2022/07/02/miri.html</a></p> </blockquote>","date_published":"2022-07-04T01:21:31.000Z"},{"id":"https://commaok.xyz/post/tstruct/","url":"https://commaok.xyz/post/tstruct/","title":"Nicer struct literals in Go templates","content_html":"<blockquote> <p><a href=\"https://lobste.rs/\">Lobsters</a> <strong>Nicer struct literals in Go templates</strong></p> <p>by carlmjohnson@users.lobste.rs (carlmjohnson) <i>#go</i></p> <p><a href=\"https://lobste.rs/s/gltczy/nicer_struct_literals_go_templates\">Comments</a></p> <p>Article URL: <a href=\"https://commaok.xyz/post/tstruct/\">https://commaok.xyz/post/tstruct/</a></p> </blockquote>","date_published":"2022-07-04T01:02:47.000Z"},{"id":"https://thehustle.co/why-nobody-ever-wins-the-mall-car-giveaway/","url":"https://thehustle.co/why-nobody-ever-wins-the-mall-car-giveaway/","title":"Why nobody ever wins the car at the mall (2018)","content_html":"<blockquote> <p><a href=\"https://news.ycombinator.com/classic\">Hacker News: Classic</a> <strong>Why nobody ever wins the car at the mall (2018)</strong></p> <p> </p> <p>Article URL: <a href=\"https://thehustle.co/why-nobody-ever-wins-the-mall-car-giveaway/\">https://thehustle.co/why-nobody-ever-wins-the-mall-car-giveaway/</a></p> <p>Comments URL: <a href=\"https://news.ycombinator.com/item?id=31971858\">https://news.ycombinator.com/item?id=31971858</a></p> <p>Points: 250</p> <p># Comments: 133</p> <p>Article URL: <a href=\"https://thehustle.co/why-nobody-ever-wins-the-mall-car-giveaway/\">https://thehustle.co/why-nobody-ever-wins-the-mall-car-giveaway/</a></p> </blockquote>","date_published":"2022-07-03T23:20:09.000Z"},{"id":"https://wired.jp/article/police-contactless-fingerprints-photos/","url":"https://wired.jp/article/police-contactless-fingerprints-photos/","title":"警官による指紋の採取が、スマートフォンのカメラによる「非接触方式」へと進化する","content_html":"<blockquote> <p><a href=\"https://wired.jp\">最新情報 Feed – WIRED.jp</a> <strong>警官による指紋の採取が、スマートフォンのカメラによる「非接触方式」へと進化する</strong></p> <p> <i>#Biometrics</i> <i>#Data</i> <i>#Digital Identity</i> <i>#Privacy</i> <i>#Security</i> <i>#Smartphone</i></p> スマートフォンのカメラと画像処理アルゴリズムを使った方法が実用化の段階に到達してきた。指紋を非接触方式で容易に採取できるようになるが、プライバシーの問題やマイノリティの差別につながる危険性も指摘されている。 <p>Article URL: <a href=\"https://wired.jp/article/police-contactless-fingerprints-photos/\">https://wired.jp/article/police-contactless-fingerprints-photos/</a></p> </blockquote>","date_published":"2022-07-03T23:00:00.000Z"},{"id":"https://asnokaze.hatenablog.com/entry/2022/07/04/000036","url":"https://asnokaze.hatenablog.com/entry/2022/07/04/000036","title":"一般ユーザに払い出すと危険なサブドメインやメールアドレス - ASnoKaze blog","content_html":"<blockquote> <p><a href=\"https://b.hatena.ne.jp/efcl/bookmark\">efclのはてなブックマーク</a> <strong>一般ユーザに払い出すと危険なサブドメインやメールアドレス - ASnoKaze blog</strong></p> <p>by efcl <i>#domain</i> <i>#DNS</i></p> <blockquote cite=\"https://asnokaze.hatenablog.com/entry/2022/07/04/000036\" title=\"一般ユーザに払い出すと危険なサブドメインやメールアドレス - ASnoKaze blog\"><cite><img src=\"https://cdn-ak2.favicon.st-hatena.com/?url=https%3A%2F%2Fasnokaze.hatenablog.com%2Fentry%2F2022%2F07%2F04%2F000036\" alt=\"\" /> <a href=\"https://asnokaze.hatenablog.com/entry/2022/07/04/000036\">一般ユーザに払い出すと危険なサブドメインやメールアドレス - ASnoKaze blog</a></cite><p><a href=\"https://asnokaze.hatenablog.com/entry/2022/07/04/000036\"><img src=\"https://cdn-ak-scissors.b.st-hatena.com/image/square/60d7862c85f355ec5c7ba5fcc0fcfe3defd48adb/height=90;version=1;width=120/https%3A%2F%2Fogimage.blog.st-hatena.com%2F10328749687239380661%2F4207112889895618850%2F1656860436\" alt=\"一般ユーザに払い出すと危険なサブドメインやメールアドレス - ASnoKaze blog\" title=\"一般ユーザに払い出すと危険なサブドメインやメールアドレス - ASnoKaze blog\" class=\"entry-image\" /></a></p><p>ユーザに対して、そのユーザ名のサブドメインやメールアドレスを払い出すWebサービスがあります。 しかし、特定のサブドメインやメールアドレスは特別な用途で使われているものもあります。そのようなサブドメインやメールアドレスを一般ユーザに払い出してしまうと危険です。 現在、IETFでは仕様上利用用途が決められて...</p><p><a href=\"https://b.hatena.ne.jp/entry/s/asnokaze.hatenablog.com/entry/2022/07/04/000036\"><img src=\"https://b.hatena.ne.jp/entry/image/https://asnokaze.hatenablog.com/entry/2022/07/04/000036\" alt=\"はてなブックマーク - 一般ユーザに払い出すと危険なサブドメインやメールアドレス - ASnoKaze blog\" title=\"はてなブックマーク - 一般ユーザに払い出すと危険なサブドメインやメールアドレス - ASnoKaze blog\" border=\"0\" style=\"border: none\" /></a> <a href=\"https://b.hatena.ne.jp/entry/s/asnokaze.hatenablog.com/entry/2022/07/04/000036\"><img src=\"https://b.st-hatena.com/images/append.gif\" border=\"0\" alt=\"はてなブックマークに追加\" title=\"はてなブックマークに追加\" /></a></p></blockquote> <p>Article URL: <a href=\"https://asnokaze.hatenablog.com/entry/2022/07/04/000036\">https://asnokaze.hatenablog.com/entry/2022/07/04/000036</a></p> </blockquote>","date_published":"2022-07-03T22:17:26.000Z"},{"id":"https://wired.jp/membership/2022/07/04/end-of-astronauts-robots-space-exploration/","url":"https://wired.jp/membership/2022/07/04/end-of-astronauts-robots-space-exploration/","title":"THE END OF ASTRONAUTS：宇宙飛行士の終焉とロボットの台頭","content_html":"<blockquote> <p><a href=\"https://wired.jp\">最新情報 Feed – WIRED.jp</a> <strong>THE END OF ASTRONAUTS：宇宙飛行士の終焉とロボットの台頭</strong></p> <p> <i>#Mars</i> <i>#Science</i> <i>#Space</i> <i>#Space Travel</i></p> いまや誰もが気づいてる疑問を口にしよう──人類が宇宙に行く必要は果たしてあるのだろうか？ 確かに有人宇宙飛行は人類のロマンをかき立ててきた。だがこれからの宇宙探査には、人間よりロボットのほうが優秀で、安価で、安全なことは明らかだ。宇宙物理学の世界的権威マーティン・リースからの提言。 <p>Article URL: <a href=\"https://wired.jp/membership/2022/07/04/end-of-astronauts-robots-space-exploration/\">https://wired.jp/membership/2022/07/04/end-of-astronauts-robots-space-exploration/</a></p> </blockquote>","date_published":"2022-07-03T22:00:25.000Z"},{"id":"https://wirelesswire.jp/2022/07/82711/","url":"https://wirelesswire.jp/2022/07/82711/","title":"日本の生産性が低い理由はロシアと相似","content_html":"<blockquote> <p><a href=\"https://wirelesswire.jp\">WirelessWire News</a> <strong>日本の生産性が低い理由はロシアと相似</strong></p> <p> <i>#ワークスタイル</i> <i>#ロシア</i> <i>#地域格差</i> <i>#人種格差</i> <i>#ITゼネコン</i> <i>#デスマーチ</i></p> 日本は、IT技術者や管理する人々をどのように扱ってきたでしょうか。元請け事業者が大きなマージンをとって、実際に手を動かす下請けの人々にかなり無理をいって、ひどい労働環境で働かせてきた結果が今です。そんな現実に、大手企業の幹部も、人権活動家も、リベラルなマスコミも、政府も、皆、目を瞑っているのです。 <p>Article URL: <a href=\"https://wirelesswire.jp/2022/07/82711/\">https://wirelesswire.jp/2022/07/82711/</a></p> </blockquote>","date_published":"2022-07-03T22:00:12.000Z"},{"id":"https://www.axion.zone/874131457210585522/","url":"https://www.axion.zone/874131457210585522/","title":"中国の富裕層が日本のインター校に子弟を通わせ始める理由","content_html":"<blockquote> <p><a href=\"https://www.axion.zone/\">アクシオン｜経済メディア</a> <strong>中国の富裕層が日本のインター校に子弟を通わせ始める理由</strong></p> <p> <i>#教育</i></p> <img src=\"https://www.axion.zone/content/images/2022/07/-1x-1--6-.jpeg\" alt=\"中国の富裕層が日本のインター校に子弟を通わせ始める理由\"><p>(ブルームバーグ) --アジア、特に中国の裕福な家庭の子供たちを引き付けようとする一流の教育関係者が後押しし、日本でインターナショナルスクールの建設ブームが起きている。</p><p>英国の有名教育機関であるハロウ、ラグビースクール、マルバーン・カレッジが島国にキャンパスを開設し、今後数年間で3000人以上の学生枠が新たに加わる予定で、日本における国際教育の拡大は2018年以来最大となる。</p> <p>Article URL: <a href=\"https://www.axion.zone/874131457210585522/\">https://www.axion.zone/874131457210585522/</a></p> </blockquote>","date_published":"2022-07-03T21:00:57.000Z"},{"id":"https://www.axion.zone/9034208923507952474523/","url":"https://www.axion.zone/9034208923507952474523/","title":"シリコンバレーの大淘汰","content_html":"<blockquote> <p><a href=\"https://www.axion.zone/\">アクシオン｜経済メディア</a> <strong>シリコンバレーの大淘汰</strong></p> <p> <i>#スタートアップ</i> <i>#金融</i> <i>#マーケット</i></p> <p>Article URL: <a href=\"https://www.axion.zone/9034208923507952474523/\">https://www.axion.zone/9034208923507952474523/</a></p> </blockquote>","date_published":"2022-07-03T21:00:52.000Z"},{"id":"https://www.axion.zone/08908974089409865098348561/","url":"https://www.axion.zone/08908974089409865098348561/","title":"マイクロソフトのクラウド、サーバー不足に苦しむ  スクエニFFの障害要因にも","content_html":"<blockquote> <p><a href=\"https://www.axion.zone/\">アクシオン｜経済メディア</a> <strong>マイクロソフトのクラウド、サーバー不足に苦しむ スクエニFFの障害要因にも</strong></p> <p> <i>#クラウド</i></p> <img src=\"https://www.axion.zone/content/images/2022/07/321012140--1-.jpg\" alt=\"マイクロソフトのクラウド、サーバー不足に苦しむ スクエニFFの障害要因にも\"><p>世界的な供給不足の中、世界中のMicrosoft Azureデータセンターは、顧客に提供できるサーバーの容量が制限された状態で運用されている。</p><p>世界各国にある20以上のAzureデータセンターでは、顧客に提供できるサーバーの容量が制限された状態で運用されていると、この問題に取り組んでいるMicrosoftの現マネージャー2人と大手顧客で働くエンジニア1人が米メディア<a href>The Information</a>に対し語っている。また、ワシントン州中央部にある主要なデータセンターをはじめ、ヨーロッパやアジアにある6つ以上のAzureデータセンターでは、来年初めまでサーバーの容量が制限される見込みであると、Microsoftのマネージャーの1人は述べているという。</p><p>容量の問題は、いくつかの要因に起因しているようだ。The Informationによると、主なものは、チップやその他の部品の世界的な不足で、新しいハードウェアの入手が難しくなっていることだと、Microsoftの現マネージャーは述べているという。この点ではMicrosoftだけではなく、AWSやGoogle Cloudも一部のデータセンターでサーバーのキャパシティ不足に悩まされていると、両社の顧客企業に勤める人物はThe Informationに対して語ったという。</p><p>しかし、Microsoftはパンデミックのずっと前からAzureの顧客に十分な容量を提供するのに苦労しており、また、アップグレード時期を迎えた老朽化したサーバー、ストレージ、ネットワーク機器を大量に抱えているため、チップ不足はより大きな打撃を与えているようだと、Microsoftの管理者の1人は述べている。</p><p>中でもゲーム会社のスクウェア・エニックスは、サーバー不足のためにデータセンターを立ち上げることができず、人気ゲーム「ファイナルファンタジーXIV」に多くの人がアクセスできない状況に<a href>陥った</a>。</p><p>ここ数カ月、Microsoftは、顧客が特定の地域で将来的にクラウドの容量を要求してくることを注視しており、場合によってはその要求を、重要なウェブサイトやビジネスアプリケーションを稼働させ続けるために必要な量に限定していると、Microsoftのマネージャーは同メディアに対し述べている。Microsoftはまた、顧客が事前に要求できるサーバーの容量に制限を設けているという。</p><p>Microsoftは最近、世界の一部の地域で、より多くのデータセンターを立ち上げ、1つのデータセンターがオフラインになっても他のデータセンターにトラフィックを転送できるようにすることに重点を置いている。その結果、個々のデータセンター内のサーバー容量を拡大することが犠牲になり、一部の顧客の問題を悪化させたと、Microsoft社のマネージャーの1人は述べている。</p><p>同メディアが取材したMicrosoftに近い人物とAzureを使用しているFortune 500企業の役員によると、Microsoftは容量の問題を回避するために、自社のクラウドコンピューティングのニーズを他のデータセンターに移動してAzureの顧客のために容量を確保するなど、多くの戦術を駆使しているとのことだ。Microsoftはサーバーの容量を割り当てる際、新規の顧客や地域よりも既存の顧客を優先すると、同社に近い人物は述べている。</p><p>Microsoftのマネージャーの1人によると、ワシントン州の主要データセンター「West US 2」やアジア、ヨーロッパの他のデータセンターでは、サーバー容量の不足が来年初めまで続く見込みとThe Informationは報じている。</p> <p>Article URL: <a href=\"https://www.axion.zone/08908974089409865098348561/\">https://www.axion.zone/08908974089409865098348561/</a></p> </blockquote>","date_published":"2022-07-03T21:00:50.000Z"},{"id":"https://www.axion.zone/96325654878520015/","url":"https://www.axion.zone/96325654878520015/","title":"フォルクスワーゲン、中国での挑戦に全力を尽くす","content_html":"<blockquote> <p><a href=\"https://www.axion.zone/\">アクシオン｜経済メディア</a> <strong>フォルクスワーゲン、中国での挑戦に全力を尽くす</strong></p> <p> <i>#EV</i> <i>#自動車</i></p> <img src=\"https://www.axion.zone/content/images/2022/07/388800210--1-.jpg\" alt=\"フォルクスワーゲン、中国での挑戦に全力を尽くす\"><p>(ブルームバーグ) -- 1983年4月11日、上海でフォルクスワーゲン（VW）と現地パートナーは中国初の自動車、箱型のセダン「サンタナ」を組み立てた。このモデルは大人気となり、中国で台頭する中産階級の象徴となり、VWは中国で最も著名な自動車メーカーとしての役割を確立した。</p><p>その後、サンタナの販売台数は減少したが、VWグループにとって中国が極めて重要であることは間違いない。VWは第1四半期に世界最大の自動車市場である中国に約40％の車両を供給した。VWは中国で9万人以上の従業員を雇用し、パートナーとともに40以上の車両および部品工場を運営している。</p><p>最高経営責任者（CEO）のヘルベルト・ディースは今週、中国を「第二の故郷」と呼び、VWの同国での事業は毎年40億ユーロ（5,700億円）以上の利益を生み出していると従業員に語った。</p><p>「私たちのボーナスの大部分は中国で生み出されたものだ」と、ディースはドイツのヴォルフスブルクで従業員に対して行ったスピーチで述べた。「私たちは、マーケットリーダーとしての地位を守るために、あらゆることを行っている」</p><p>そのトップの座を守ることは、ますます難しくなっているようだ。VWの中国での販売台数は、2018年の420万台をピークに、昨年は330万台まで落ち込んでいる。ポルシェやアウディといった同社のプレミアムブランドはまだ好調だが、VWブランドは市場シェアを譲っている。</p><p>Li Auto、Nio、Xpengなどの地元メーカーが急速に追い上げており、彼らは電池駆動の車にオールインしている。ブルームバーグ編集長のジョン・ミクレスウェイトが先週、イーロン・マスクにフォルクスワーゲンに対するテスラの対抗心について尋ねたところ、CEOは代わりに、競争力を増す中国のEVメーカーを指摘した。</p><p>国内最大のライバルは、ウォーレン・バフェットのバークシャー・ハサウェイが支援する深センのメーカー、BYDになりそうだ。BYDは、ロックダウン、チップ不足、価格上昇を同業他社よりもうまく処理し、時価総額1兆元クラブに入る勢いだ。</p><p>BYDはテスラに電池を供給する可能性があり、重要な電池資源を確保する上で長期的な優位性を得たいと考え、リチウム採掘への直接関与を強めている。BYDは昨年32万台以上のEVを販売したが、VWはIDシリーズの電気自動車を中国で約7万台販売し、社内目標を大幅に下回っている。</p><p>VWは、市場シェアを拡大するために、主にヨーロッパで設計されたモデルを出荷する代わりに、地元のバイヤーに合わせたアメリカ製の車に焦点を当てることで、アメリカでのやり方を変えつつある。一部の購買層が純粋な走行性能よりもコネクティビティやエンターテインメントを重視する中国では、同様のことをより多く行う必要があるのだろう。</p><p>「この中で、カラオケ機能に200ユーロを費やす人はいるのだろうか？」と、ディースは火曜日に従業員に尋ねた。「多くの中国人にとって、それは標準的なことだ。だから我々はそれを提供しなければならない」</p><p>VWは中国地域委員会を設立し、ブランドのためにより良い、より迅速な決定を下すことにしている。ディースは、VW乗用車ブランドの責任者であるラルフ・ブランドシュテッターを役員会の監督に派遣し、元フアウェイ顧問のマーカス・ハフケマイヤーが技術を、VWロシア幹部のステファン・メカが販売を統括する予定である。</p><p>もうひとつ、人事異動では簡単に解決しない問題がある。中国政府はVWに上海工場の拡張を認める見返りに、新疆ウイグル自治区の経済発展を促進するため、新疆ウイグル自治区にも工場を設置するよう要請した。</p><p>VWは、ウイグル族が同地域で強制的な労働慣行に苦しんでいるという疑惑に対処するよう、強い圧力にさらされている。最近、2人の取締役が懸念を表明している。VWの新疆工場を担当する現地パートナー、SAICは、労働者が虐待されていることはないと述べている。ディアスの考えでは、VWの新疆ウイグル自治区での存在は、良い方向に向かう可能性がある。</p><p>しかし、VWは今、ドイツ政府からの反発にさらされている。この問題に詳しい人物によると、ベルリンは最近、VWの中国事業に対するリスク保険の更新要請を人権上の懸念から拒否したという。この拒否は、過去20年間に欧州連合（EU）外でドイツにとって最大の貿易相手国となった中国に対する考え方の変化を反映している。</p><p>ディアスは、この問題に自ら取り組むよう圧力を受けている。火曜日、彼はコヴィッドの状況が許す限り、すぐに新疆工場を訪問することを約束した。ただ、VWがこの国での野心を縮小させるとは思わないでほしい。</p><p>「我々は中国に多額の投資を続けるだろう」とディアスは言った。「そのノウハウとスピードの恩恵を受け続けるだろう」とディアスは語った。</p><p>Stefan Nicola, Monica Raymunt. Volkswagen Pulls Out All the Stops to Address China Challenges.</p><p>© 2022 Bloomberg L.P.</p> <p>Article URL: <a href=\"https://www.axion.zone/96325654878520015/\">https://www.axion.zone/96325654878520015/</a></p> </blockquote>","date_published":"2022-07-03T21:00:45.000Z"},{"id":"https://www.axion.zone/798456431276321/","url":"https://www.axion.zone/798456431276321/","title":"中国トップクラスのテック投資家、取り締まりが転換点を迎えたと見る","content_html":"<blockquote> <p><a href=\"https://www.axion.zone/\">アクシオン｜経済メディア</a> <strong>中国トップクラスのテック投資家、取り締まりが転換点を迎えたと見る</strong></p> <p> <i>#中国</i></p> <img src=\"https://www.axion.zone/content/images/2022/07/-1x-1--6--3.jpeg\" alt=\"中国トップクラスのテック投資家、取り締まりが転換点を迎えたと見る\"><p>(ブルームバーグ) -- 中国最大のプライベートエクイティ投資家の1人の創業者は、最近の暴落でピーク時の市場価値2兆ドル近くが一掃された後、中国のハイテク企業は曲がり角にあると述べた。</p><p>元ゴールドマン・サックス・グループのレインメーカーで、170億ドルの中国のプライベート・エクイティ企業プリマベラ・キャピタルを立ち上げたフレッド・フーは、規制に関する心強いメッセージ、堅調な収益、打ちのめされたバリュエーションが、今やこの分野を投資家にとって興味深いものにしていると述べた。</p><p>同社会長のフーは最近のインタビューで、「これは中国のハイテク企業にとって新しい時代の始まりかもしれない」と述べている。「発見されるべき価値がたくさんある」と述べ、このような企業のリスクが高いことを考えると、投資家にとってまだ選択的のひとつにすぎないと付け加えた。</p><p>プライベート・エクイティの巨匠の見解は、世界の投資家がハイテク株に再び回転し始める中で、好転を支持するこれまでで最も強い声明の1つだ。中国共産党による1年にわたる取り締まりは、業界関係者がより厳しい見方を示すなかでも、端々に和らいだ兆しを見せている。</p><p>2010年に設立されたプリマベーラは、Private Equity Internationalによると、中国で4番目に大きなプライベート・エクイティ・ファームに位置づけられている。同社のウェブサイトによると、これまでの投資先には、ファーストフードチェーンのYum China Holdings Inc.、電気自動車メーカーのXPeng Inc.、電子商取引大手のAlibaba Group Holding Ltd.などが含まれている。</p><p>中国人民銀行が金融政策の支持を維持すると表明したことで、中国国内のハイテク企業の回復に賭けるJPモルガン・アセット・マネジメントやゴールドマン・サックスなどの銀行と同様に、フーもこの銘柄に買いを集めているのだそうだ。</p><p>Didi Global Inc.（ディディ）に対する規制当局の調査が終了し、アントグループの上場が復活する可能性が出てきたとの報道は、楽観的な見方を強めている。中国のハイテク株の指標は今月11％上昇し、約2年ぶりの高水準となる勢いだ。</p><p>プリマベーラのフレッド・フーは、3月の中国株の暴落を「過剰」だとし、アリババが「深い価値」を提供していると述べ、他の企業がハイテク企業を見放す中でも、ハイテク企業に対する幅広い前向きな見通しを維持してきた。プリマベーラは今年初め、大中華圏の高成長分野を対象とした初の特別目的買収会社の1つである香港の上場申請を行いた。</p><p>この長年のテックセクターの支持者は、億万長者のジャック・マーのアントグループの初期の投資家で、以前はフィンテック企業の取締役会で独立非常勤取締役を務めていた。</p><p>中国の億万長者の起業家にとって重要な国際金融機関であるUBSグループの取締役でもあるフーは、アントのIPOの進捗状況についてのコメントは避けながらも、香港の新規株式公開のパイプラインは依然として「非常に強固」で、高品質の企業が引き続き投資家を引きつけるだろうと述べた。</p><p>ブルームバーグがまとめたデータによると、香港のIPOによる資金調達額は、アントの上場が規制当局に停止された2020年11月の125億ドルから5月にはわずか1億3,900万ドルにまで低迷している。</p><h3 id=\"%E4%BA%BA%E6%9D%90%E3%81%AE%E6%B5%81%E5%87%BA\">人材の流出</h3><p>ディールフローの鈍化に加え、香港の厳しい検疫規則と北京の締め付けが、特に多くの外国人を雇用している金融業界において、頭脳流出の懸念を煽っている。外国人金融サービス従事者に新たに発給されたビザは昨年2,569件となり、2018年からほぼ50％減少した。ニューヨーク、ロンドン、シンガポールなど他の金融センターでの機会を求めて、この街を離れることを決めた銀行員が増えている。</p><p>それでも、プライベート・エクイティは離職による痛みを感じていないと胡は述べ、プリマベーラの香港ベースの求人への応募には引き続き「多大な関心」が寄せられていると付け加えた。</p><p>香港の金融政策が正常化すれば、香港に金融の人材が戻ってくるはずだとフーは言う。香港の次期行政長官である李家超（ジョン・リー）は、「不必要な規制の多くを緩和、あるいは撤廃するよう努力すべきだ」と考えている。</p><p>「香港の経済や国際競争力に大きな打撃を与えることになる。香港をもっと普通の国、世界のようにするんだ」。</p><p>-- Stephen Engleの協力を得た。</p><p>John Cheng. One of China’s Top Tech Investors Sees Crackdown Turning Point.</p><p>© 2022 Bloomberg L.P.</p> <p>Article URL: <a href=\"https://www.axion.zone/798456431276321/\">https://www.axion.zone/798456431276321/</a></p> </blockquote>","date_published":"2022-07-03T21:00:09.000Z"},{"id":"https://mikolaj-kaminski.com/how-to-test-typed-http-client-with-di/","url":"https://mikolaj-kaminski.com/how-to-test-typed-http-client-with-di/","title":"How to test typed HTTP clients in .NET 6?","content_html":"<blockquote> <p><a href=\"https://lobste.rs/\">Lobsters</a> <strong>How to test typed HTTP clients in .NET 6?</strong></p> <p>by mikas@users.lobste.rs (mikas) <i>#dotnet</i> <i>#testing</i></p> <p>Strongly typed HTTP clients are very useful and convenient. Here’s how to test them without sacrificing the advantages of dependency injection.</p> <p><a href=\"https://lobste.rs/s/o5gofq/how_test_typed_http_clients_net_6\">Comments</a></p> <p>Article URL: <a href=\"https://mikolaj-kaminski.com/how-to-test-typed-http-client-with-di/\">https://mikolaj-kaminski.com/how-to-test-typed-http-client-with-di/</a></p> </blockquote>","date_published":"2022-07-03T19:47:33.000Z"},{"id":"https://lobste.rs/s/jclvos/one_decade_lobsters","url":"https://lobste.rs/s/jclvos/one_decade_lobsters","title":"One Decade of Lobsters","content_html":"<blockquote> <p><a href=\"https://lobste.rs/\">Lobsters</a> <strong>One Decade of Lobsters</strong></p> <p>by pushcx@users.lobste.rs (pushcx) <i>#announce</i></p> <p>Hey folks,</p> <p>Lobsters launched 10 years ago today.</p> <p>In that time our community of 15,013 users have submitted 87,530 stories, written 381,460 comments, and cast 2,536,117 votes. There are some nice graphs over at <a href=\"https://lobste.rs/stats\" rel=\"ugc\">/stats</a>.</p> <p>Previously: <a href=\"https://lobste.rs/s/rxmopc/lobsters_is_1_year_old_today\" rel=\"ugc\">2013</a> <a href=\"https://lobste.rs/s/9fcuzc/happy_birthday_lobste_rs\" rel=\"ugc\">2016</a> <a href=\"https://lobste.rs/s/mazaum/happy_5th_anniversary_lobsters\" rel=\"ugc\">2017</a> <a href=\"https://lobste.rs/s/cgtc2w/happy_7th_anniversary_lobsters\" rel=\"ugc\">2019</a> <a href=\"https://lobste.rs/s/orrpdv/lobsters_launched_8_years_ago_today\" rel=\"ugc\">2020</a> <a href=\"https://lobste.rs/s/idj3tm/lobsters_is_nine_today\" rel=\"ugc\">2021</a></p> <p>For the occasion you might look back at the <a href=\"https://lobste.rs/top/1y\" rel=\"ugc\">top stories</a> of the year or <a href=\"https://lobste.rs/top/10y\" rel=\"ugc\">decade</a>, or review the <a href=\"https://lobste.rs/upvoted/comments\" rel=\"ugc\">comments</a> and <a href=\"https://lobste.rs/upvoted/stories\" rel=\"ugc\">stories</a> you’ve upvoted. What were your favorites?</p> <p>Article URL: <a href=\"https://lobste.rs/s/jclvos/one_decade_lobsters\">https://lobste.rs/s/jclvos/one_decade_lobsters</a></p> </blockquote>","date_published":"2022-07-03T18:13:19.000Z"},{"id":"https://okuranagaimo.blogspot.com/2022/07/blog-post_59.html","url":"https://okuranagaimo.blogspot.com/2022/07/blog-post_59.html","title":"人は多過ぎるのか、それとも少な過ぎるのか?","content_html":"<blockquote> <p><a href=\"https://okuranagaimo.blogspot.com/\">ブログ</a> <strong>人は多過ぎるのか、それとも少な過ぎるのか?</strong></p> <p>by Unknown <i>#backreaction</i> <i>#Science</i></p> <p><a href=\"http://backreaction.blogspot.com/2022/07/are-we-too-many-people-or-too-few.html\">ザビーネ・ホッセンフェルダーのブログより</a>。</p><blockquote class=\"ref\"><p>男性が多過ぎる、人が多過ぎる、問題が多過ぎます。ジェネシスはそう言っています。一方、イーロン・マスクは、地球上にいる人が少な過ぎると考えています。「<a href=\"https://youtu.be/HZP67-DECVw?t=2829\">多くの人は、地球上に人が多過ぎると思っていますが、私は実際、少な過ぎると思います</a>。」さて、どちらが正しいのでしょうか? 人が多過ぎるのか、少な過ぎるのか? 今日その話しをしましょう。</p> <div class=\"separator\" style=\"clear: both;\"><img alt=\"\" border=\"0\" height=\"351\" width=\"500\" src=\"https://blogger.googleusercontent.com/img/b/R29vZ2xl/AVvXsEhZaDOlWIv1YsKcOStc33g8-IZf88T_c2bRagMmAMG9oEyri6UeN-2XAVDrN3v-QgJ8I_4In9rUShvkYGYIWOQ6-gDIKLfyxeyAwwUTg_Adao-sqlRDK8QTqu3bFjlXHRT_4ZD8DWBYeLDkck1WfdrCpV5jCMMXSYY_04J3APC1E7V9_iztJDJhi-Sfeg/s1600/world-population-12000.png\"/></div> <p>このグラフは、過去12,000年間の世界人口の増加を示しています。ペストがヨーロッパとアジアの人口の大部分を一掃した14世紀の落ち込みを除けば、指数関数的な増加のように見えます。</p> <p>この曲線を外挿すると、1000年後には数兆人の人間がいることになります。しかし、これは人口増加おん仕組みではありません。遅かれ早かれ、すべての種はある種の資源の限界にぶつかります。では、私たちはいつその限界に達するのでしょうか?</p> <p>人類がこの惑星の資源限界にどれだけ近づいているかという問題については、ドゥームスター(破滅派)とブームスター(好景気派)の2つの極端な意見があります。ドゥームスターとブームスターというと、まるでロックミュージカルで、今にも歌い出しそうな対立するギャングのようですが、現実はもう少し悲惨です。両者の言い分を聞いた上で、科学的にどうなのかを見てみましょう。</p> <p>ドゥームスターには長い伝統があり、少なくとも18世紀のトーマス・マルサスにまでさかのぼります。マルサスによると、一言で言えば、人口は食糧生産よりも急速に増加しており、すべての人を養うことがますます難しくなるだろうと言いました。もしそうなったら、とても残念なことです。なぜなら、皆さんはどうか分かりませんが、私は食べ物を食べ続けたいからです。特にチーズ。特にチーズを食べ続けたいんです。</p> <p>マルサスの問題は、1968年にポール・エーリックが出版した『人口爆弾』という本で広められましたが、タイトルがすべてを物語っています。エーリックは、1980年代には飢饉が常態化し、世界の死亡率が上昇すると予言しました。お気づきかもしれませんが、これは起こりませんでした。現実には、死亡率は低下し続けており、平均してカロリー消費量は世界的に増加しています。それでもエーリックは、自分の予測は基本的に正しかった、予想したより少し長くかかるだろうと主張しています。</p> <p>実際、1972年のローマクラブの報告書では、21世紀半ばに「成長の限界」に達し、その後は、私たちが限られた資源を十分に注意深く扱わなかったために、人口が急減すると予測していました。</p> <p><a href=\"https://www.sciencedirect.com/science/article/abs/pii/S0959378008000435?via%3Dihub\">21世紀初頭に行われたいくつかの分析</a>では、ローマクラブの従来通りの予測は、今のところ現実から大きく外れていないことが判明しています。</p> <p>アース・オーバーシュート・デイは、私たちがどれだけ資源を使い切っているかを数値化する直感的な方法です。このアイデアは、サセックス大学のアンドリュー・シムズが提唱したもので、これは地球がその年に再生する資源を、各暦年の何月何日までに使い果たすかを計算するものです。もし、その日が年内であれば、毎年、残りの資源を縮小していくことになり、結局、持続可能ではないのです。</p> <div class=\"separator\" style=\"clear: both;\"><img alt=\"\" border=\"0\" height=\"358\" width=\"500\" src=\"https://blogger.googleusercontent.com/img/b/R29vZ2xl/AVvXsEgoRhkJQziZR5LoqQpl2ytt3aEycr-fecdzvvtd8dwEna_KUj8cWhdHXLhVwsJ5f6VgPycNqCav64CObsimGjVOGq7pMDvWx0acYep2iPsMOll_12spVuutWM_w9BsnEcQ57ORVsC6ccjsRV30oU5OVr-gLIh-ZGRm-GPdtBoRw4GrfH28CHNJdcjoZVA/s1600/earth-overshoot-day.png\"/></div> <p>この図は、1970年以降のアース・オーバーシュート・デイを示しています。<a href=\"https://www.overshootday.org/newsroom/past-earth-overshoot-days/\">ご覧のように</a>、過去10年ほどの間に、私たちは8月初旬に再生可能な資源を使い果たしまいました。2020年、COVIDのパンデミックにより、その日付は一時的に2日ほど後ろにずれましたが、今はまた軌道に乗り、どんどん早くオーバーシュート・デイに到達しています。まるで、グラウンドホッグ・デイと蜂蜜と出会うようなもので、私は資源を縮小しました。明らかに、誰も望んでいないものです。</p> <p>したがって、ドゥームスターの懸念はまったく不当というわけではありません。私たちは間違いなく、資源を責任を持って扱っていません。人口過密はうわべではなく、すでに現実のものとなっている場所もあります。例えば、ロサンゼルスの人口密度は1平方キロメートルあたり約3000人ですが、フィリピンのマニラの10倍以上、1平方キロメートルあたり43,000人という驚異的な人口密度です。あまりの狭さに、墓地に住み着いた家族もいるほどです。一般論として、皆さんも同意いただけると思いますが、なるべく死体の近くで寝なくて済むようにすべきだと思います。</p> <p>このような極端な人口過密は、病気の蔓延を助長し、環境を清潔に保つための法律を施行することが非常に難しくなり、健康上のリスクとなるのです。ここで実際の問題は人口過剰ではなく、貧困であると主張するかもしれませんが、実際にはどちらも単独ではなく、両者の関係なのです。人々の数は、少なくとも生活水準を安定させるために必要な資源よりも速く増加します。</p> <p>地球規模で見ると、気候変動とそれに伴う生物多様性の喪失の根本的な問題は、地球上に人間が多過ぎることだと、ドゥームスターたちは主張しています。 </p> <p><a href=\"https://www.science.org/content/article/best-way-reduce-your-carbon-footprint-one-government-isn-t-telling-you-about\">何年か前に、</a><a href=\"https://www.theguardian.com/environment/2017/jul/12/want-to-fight-climate-change-have-fewer-children\">こんな見出しを</a><a href=\"https://www.forbes.com/sites/janetwburns/2017/07/20/scientists-say-family-planning-is-our-best-bet-to-reduce-climate-change/\">目にしたことが</a><a href=\"https://www.nbcnews.com/think/opinion/science-proves-kids-are-bad-earth-morality-suggests-we-stop-ncna820781\">あるかも知れません</a>。「気候変動と戦いたいのか? 子供を減らせ!」、「科学者たちは、子供の数を減らすことが気候変動を抑える最善の策だと言っている」、「科学が、子供は地球に悪いと証明している。」この見出しは、雑誌「Environmental Research Letters」に掲載された<a href=\"https://iopscience.iop.org/article/10.1088/1748-9326/aa7541/pdf\">2017年の論文</a>を要約したものです。その著者たちは、39の査読済み論文と政府の報告書を調べました。彼らは、どのようなライフスタイルの選択が、私たちの個人的な排出量シェアに最も大きな影響を与えるかを知りたかったのです。</p> <p>リサイクルも、車を変えることも、大西洋横断便を避けることも、あまり効果がないことが分かっています。飛行機を怖がある人にとっては残念なことですが、環境保護のために飛行機に乗らないことは、もはや言い訳になりません。本当に違いがあったのは、子供を持たないことでした。これは、次に挙げた「自動車を使わない生活」の25倍も重要なことでした。彼らがこの結論に至った主な理由は、子供たちの半分、そして孫たちの4分の1の炭素排出量を受け継ぐと仮定したからだそうです。</p> <p><a href=\"https://www.theguardian.com/lifeandstyle/2022/jan/12/more-people-is-the-last-thing-this-planet-needs-the-men-getting-vasectomies-to-save-the-world\">2022年のヘッドライン</a>を早送りすると、自動車を乗り続けても罪悪感を抱かないように、男性がパイプカット術を受けていることが分かります。イーロン・マスクは8人の子供をもうけましたが、私がこの文章を書き終える頃には、もう少し増えているかも知れません。では、もう一方の議論であるブームスターを見てみましょう。</p> <p>マルサスやエーリックが如何に間違っていたかが、ブームスターの火種になっています。両者とも間違っていたのは、技術の進歩によってどれだけ農業収穫量を向上し、その結果、健康や教育を改善され、さらなる技術の進歩につながるかを劇的に過小評価していたからです。ブームスターは、この過去の成功を外挿し、人間の創意工夫が常にその日を救うと主張します。</p> <p>この点を説明するために、エコノミストのジュリアン・サイモンが開発したのが、「<a href=\"https://www.humanprogress.org/the-simon-abundance-index-2021/\">サイモン豊度指数</a> (Simon Abundance Index)」と呼ばれるものです。サイモンが豊富かどうかが分かると思うかも知れませんが、そうではなく、50種類の基礎的な商品の豊富さと人口増加との関係が分かるのです。サイモンの言う「基本的商品」のリストには、ウラン、プラチナ、タバコなどの日常的な必要なものは含まれていますが、チーズは含まれていません。どうやら、サイモンと私では、基本的商品に対する考え方が違うようです。</p> <p>この指数は、商品の価格と平均時給の比率で計算されるため、基本的には、その商品をどれだけ買うことができるかを示す指標です。</p> <p>指数は100パーセントを基準の1980年に正規化されます。2020年、指数は708.4パーセントに達しました。そして、その曲線はほとんど上がっているので、確かにそれは良いことです。ブームスターは、何かを証明するためにこの指数を引用したがります。</p> <p>さて、これは少し単純すぎるような気もするし、自分の収入で買えるタバコの量と天然資源にどのような関係があるのだろうか​​疑問に思うかもしれません。確かに、この指標は科学文献を探しても見つかりません。資源の豊富さを測る指標としては、一般に認められていません。それは、テクノロジーによって効率が上がり、資源がある限り価格が下がるという傾向を捉えているのです。資源がいつまで続くかについては、何も教えてくれません。</p> <p>しかし、過去の悲観的な予測は当たらず、人口不足も問題であるという点では、ブームスターの意見も一理あります。確かに、カナダ、ノルウェー、スウェーデンといった国は、北部の領土で人口不足の問題を抱えています。生活水準を維持するのに十分な人数がいなければ、生活水準を維持するのは難しいのです。インフラはもちろん、教育や医療サービスもそうです。現在のような複雑な文明は、わずか数百万人の人口では維持できません。YouTubeのビデオを作るような、必要な作業を学び、実行するには人数が足りないのです。</p> <p>もう一つの問題は、年齢分布です。歴史の大半はピラミッド型で、高齢者より若い人の方が多いのです。この例は、日本の人口ピラミッドと、過去1世紀における変化を示しています。子どもの数が減ると、若い人より高齢者の方が多い「逆ピラミッド型」に変わり、高齢者の適切な世話をすることが難しくなります。</p> <p>日本や韓国などでは、すでにこの現象が起きており、近い将来、先進国のほとんどでこの現象が起きるでしょう。しかし、逆ピラミッドは人口減少によるもので、人口不足から来るものではなく、人口が安定すれば解決する一時的な問題です。</p> <p>さて、ここまでドゥームスターとブームスターの言い分を見てきましたが、次は科学的な言い分を見てみましょう。</p> <p>人口過剰について語るときに役立つ用語は、生態系の「環境収容力」です。これは、生態系が無限に維持できる生物の最大個体数です。つまり、私たちが知りたいのは、地球が人間に対してもつ環境収容力です。</p> <p>この数値を決定する最も正確な方法について、科学者の間でも意見が分かれており、推定値も大きく異なっています<a href=\"https://na.unep.net/geas/archive/pdfs/geas_jun_12_carrying_capacity.pdf\">40〜160億人の間</a>というのが大方の予想です。しかし、一部の悲観論者は環境収容力が20億人程度であり、私たちはとっくにそれを超えていると言い、ある楽観論者は、地球上に1,000億人以上を人口を押し込むことができると考えています。</p> <p>これらの推定値は、予測が極めて難しい要因に左右されるため、非常にばらつきがあります。例えば、どれだけの人を養えるかは、その人の典型的な食生活に依存します。地球は、肉しか食べないジョーダン・ピーターソンの数よりも多くのビーガンを維持することができますが、ジョーダン・ピーターソンが1人でも多過ぎると思う人もいるかも知れません。もちろん、人口増加に伴う技術の進歩の速さにもよりますが、これは基本的に推測に過ぎません。</p> <p>結局のところ、地球の環境収容力は控えめに見積っても現在の人口とほぼ同じですが、非常に楽観的に考えれば、1,000億人までいけるかも知れないということです。もう一つ、人口データから傾向を推測することができます。</p> <p>冒頭のグラフは指数関数的に増加しているように見えるかもしれませんが、これはちょっと違います。過去50年間をもう少し詳しく見てみると、12年ごとに10億人ずつ着実に増えていることが分かります。<a href=\"https://ourworldindata.org/grapher/exports/UN-population-projection-medium-variant.svg\">これは指数関数的ではありません</a>。地球上の様々な地域の出生率を見ると、何が起こっているのかがより明確になります。</p> <p>出生率とは、人口統計学者が「一人の女性が出産する子供の平均数」と呼んでいるものです。この数値がおよそ2.1を下回ると、人口規模は減少に転じます。2.1は人口置換水準と呼ばれます。特筆すべきは、この2.1が、乳幼児の死亡率が低い先進国での人口置換水準であることです。乳幼児の死亡率が高ければ、人口置換水準は高くなります。</p> <p>現在の出生率は国によって大きな差があります。最も裕福な国では、出生率は長い間人口置換水準を下回っています。例えば、アメリカの現在の出生率は1.81で、日本は1.33です。しかし、発展途上国の出生率は依然として高く、例えば、アフガニスタンでは6.01、ニカラグアでは7.08です。この状況はどうなっていくのでしょうか?</p> <p>もちろん分かりませんが、この傾向を推定することはできます。2020年10月、「ランセット」誌は、まさにそれを行った<a href=\"https://www.thelancet.com/action/showPdf?pii=S0140-6736%2820%2930677-2\">大規模な調査結果</a>を発表しました。ワシントン大学の研究者チームは、現在から2100年までの185か国の人口推移を予測しました。彼らは複数のモデルを使用して、移住、教育達成度、避妊具の使用などの推移を予測し、平均寿命や出生率への影響を計算しました。</p> <p>彼らの予測によると、世界人口は2064年の97億3000万人をピークに徐々に減少し、2100年には87億9000万人になると予測しています。その頃には、出生率は世界全体でわずか1.66まで低下します(95% 1.33-2.08)。</p> <p>これは、ローマクラブの報告書と驚くほど一致しています。また、個々の国についても調べています。例えば、中国は2100年までに人口が48%減少し、7億3200万人という数になると予想されています。習近平が中国人にもっと子供を産むように求めているのも不思議ではありません。</p> <p>アメリカとイギリスは主に移民の受け入れによって、ほぼ同じ人口を維持することが予想されています。日本は現在の低出生率にとどまり、その結果、人口は現在の1億2840万人から5970万人にまで減少すると予想されています。</p> <p><a href=\"https://twitter.com/elonmusk/status/1523045544536723456\">つい数週間前、マスクはこのことについてコメントし、日本が「消滅」する可能性があると主張しました</a>。日本が今世紀末までに人口を半減させる可能性が高いことを確かであり、この傾向を無限に延長すれば、そうです、日本は消滅してしまいます。しかし、この数字の背景を考えてみましょう。</p> <div class=\"separator\" style=\"clear: both;\"><img alt=\"\" border=\"0\" height=\"415\" width=\"500\" src=\"https://blogger.googleusercontent.com/img/b/R29vZ2xl/AVvXsEhAG_zjV2okehEJqHibjSHZDIv5WGStPaq0DluFnQYSdMZNoVkw_Is8uYvW_GPpRGrzMB5H8-eC5ILr9EIV8kVsiMrQB0cu_JOKqo8d-yoLhrVwtXNetSwh7FJNQ6rMn0Su75q3MORzY-l7IZBG-dgm1Z19okQy2i8aESP1XSLC_f_yhSX2N9QDNVGvgw/s1600/japan-population.png\"/></div> <p><a href=\"https://www.statista.com/statistics/1066956/population-japan-historical/\">この図は、1800年から現在までの日本人の人口の推移を示したものです</a>。10年前がピークで、約1億3000万人でした。日本がテキサス州の約半分の面積であることを考えると、人口密度は現在のアメリカの約10倍です。つまり、日本の人口密度はアメリカの約10倍です。ランセットの論文によると、日本は人口が半分になっても世界第4位の経済大国であり続けると予測しており、人口が永遠に減少し続けるとは誰も予想していません。だから、マスクがどう思おうと、日本人にとって未来は素晴らしいものに見えます。</p> <p>ヨーロッパはどうなっていますか? ドイツの人口は、2100年には現在の8,300万人から6,600万人になると予測されています。スペインとポルトガルでは、人口が半分以上になります。しかし、すべてのヨーロッパ諸国に当てはまるわけではありません。特に北部の国々は、緩やかな増加が見込まれています。例えば、ノルウェーは現在の550万から約700万に、スウェーデンは現在の1000万から1300万に増加すると予測されています。</p> <p>しかし、最大の人口増加は、高い出生率と生活環境のさらなる改善により、現在開発が進んでいない地域で起こると考えられています。例えば、ランセットの推計によると、ナイジェリアは現在の2億600万から7億9100万へと驚異的に増加します。そうです、2100年にはナイジェリア人は中国人より多くなっています。ニジェールは2100万から1億8500万へと爆発的に増加します。</p> <p>全体として最も増加するのはサハラ以南のアフリカで、現在の10億人から30億人に増加しますが、そこでも今世紀末には出世率が代替率を下回ると予測されています。もし、自分の国の出生率予測を確認したい場合は、この論文をチェックして下さい。</p> <p>これらの外挿は、通常どおりビジネスを想定しています。しかし、同論文は、教育と避妊に関する国連の持続可能な開発目標が達成された場合の代替シナリオも検討しています。その場合、人口はもっと早く減少し始め、2046年に85億人でピークを迎え、2100年には世界人口は63億から69億人の間になると言います。</p> <p>ここから何が分かるのでしょうか? 世界の環境収容力を控えめに見積もり、人口動向を外挿すると、世界人口は環境収容力を下回る比較的早い時期にピークに迎えそうです。人口の減少は、国内的にも国際的にも権力構造に大きな変化をもたらすでしょう。それは多くの政治的緊張と経済的ストレスを引き起こすでしょう。また、パンデミックや戦争、気候変動による大規模な経済危機によって、10億人ほどが死滅するリスクも含まれていません。</p> <p>つまり、ドゥームスターとブームスターのどちらも間違っているのです。ドゥームスターは人口過剰が問題であると考えるのは間違っていますが、問題があると考えるのは正しいのです。ブームスターは、世界はもっと多くの人々を受け入れることができると考えている点は正しいのですが、それを成し遂げられると考える点では間違っています。</p> <p>そして、私は、マスクが正しいのではないかと心配しています。もし、私たちがもっと賢くカードを使えば、この地球にもっと多くの人々を押し込めることはほぼ間違いないでしょう。そして、進歩のために最も重要な要素は人間の頭脳であることを考えると、もしあなたが進歩を大切にしているのなら、私たちは必ずしも最善の道を歩んでいるとは言えません。</p></blockquote><p><a href=\"https://news.ycombinator.com/item?id=31958715\">Hacker News</a></p> <p>Article URL: <a href=\"https://okuranagaimo.blogspot.com/2022/07/blog-post_59.html\">https://okuranagaimo.blogspot.com/2022/07/blog-post_59.html</a></p> </blockquote>","date_published":"2022-07-03T18:03:53.217Z"},{"id":"https://prog21.dadgum.com/87.html","url":"https://prog21.dadgum.com/87.html","title":"Write Code Like You Just Learned How to Program","content_html":"<blockquote> <p><a href=\"https://lobste.rs/\">Lobsters</a> <strong>Write Code Like You Just Learned How to Program</strong></p> <p>by nalzok@users.lobste.rs (nalzok) <i>#practices</i></p> <p><a href=\"https://lobste.rs/s/5ozh2p/write_code_like_you_just_learned_how\">Comments</a></p> <p>Article URL: <a href=\"https://prog21.dadgum.com/87.html\">https://prog21.dadgum.com/87.html</a></p> </blockquote>","date_published":"2022-07-03T17:49:08.000Z"},{"id":"https://lab.quantumflytrap.com/lab","url":"https://lab.quantumflytrap.com/lab","title":"Virtual Lab by Quantum Flytrap","content_html":"<blockquote> <p><a href=\"https://lobste.rs/\">Lobsters</a> <strong>Virtual Lab by Quantum Flytrap</strong></p> <p>by Corbin@users.lobste.rs (Corbin) <i>#science</i> <i>#visualization</i></p> <p><a href=\"https://lobste.rs/s/nhvlcr/virtual_lab_by_quantum_flytrap\">Comments</a></p> <p>Article URL: <a href=\"https://lab.quantumflytrap.com/lab\">https://lab.quantumflytrap.com/lab</a></p> </blockquote>","date_published":"2022-07-03T17:46:38.000Z"},{"id":"https://econ101.jp/アダム・トゥーズ「アメリカ経済は大規模な景気/","url":"https://econ101.jp/アダム・トゥーズ「アメリカ経済は大規模な景気/","title":"アダム・トゥーズ「アメリカ経済は大規模な景気後退局面に入りつつある」（2022年７月２日）","content_html":"<blockquote> <p><a href=\"https://econ101.jp\">経済学101</a> <strong>アダム・トゥーズ「アメリカ経済は大規模な景気後退局面に入りつつある」（2022年７月２日）</strong></p> <p> <i>#アダム・トゥーズ</i> <i>#翻訳記事</i></p> <p><a href=\"https://adamtooze.substack.com/p/chartbook-132-nowcasting-the-immediate\">Chartbook #132 Nowcasting – the immediate outlook for the US economy</a><br>Posted by <a href=\"https://econ101.jp/category/translation/adam-tooze/\">Adam Tooze</a> on Juky 2, 2022</p> <p>FRBが金融引き締め政策への転換を発表したため、アメリカの金融状況（借り入れ条件の広義の水準）は、1980年代前半以降のどの時点より資金調達が困難となっている。</p> <figure class=\"wp-block-image size-large\"><img width=\"1024\" height=\"698\" src=\"https://i0.wp.com/econ101.jp/wp-content/uploads/2022/07/E_F01.jpg?resize=1024%2C698&ssl=1\" alt=\"\" class=\"wp-image-48360\" srcset=\"https://i0.wp.com/econ101.jp/wp-content/uploads/2022/07/E_F01.jpg?resize=1024%2C698&ssl=1 1024w, https://i0.wp.com/econ101.jp/wp-content/uploads/2022/07/E_F01.jpg?resize=300%2C204&ssl=1 300w, https://i0.wp.com/econ101.jp/wp-content/uploads/2022/07/E_F01.jpg?resize=768%2C523&ssl=1 768w, https://i0.wp.com/econ101.jp/wp-content/uploads/2022/07/E_F01.jpg?resize=380%2C259&ssl=1 380w, https://i0.wp.com/econ101.jp/wp-content/uploads/2022/07/E_F01.jpg?resize=800%2C545&ssl=1 800w, https://i0.wp.com/econ101.jp/wp-content/uploads/2022/07/E_F01.jpg?resize=1160%2C790&ssl=1 1160w, https://i0.wp.com/econ101.jp/wp-content/uploads/2022/07/E_F01.jpg?w=1456&ssl=1 1456w\" sizes=\"(max-width: 1024px) 100vw, 1024px\" data-recalc-dims=\"1\" /><figcaption><strong>アメリカ国債の利率を巡る金融状況</strong></figcaption></figure> <p>出典：<a href=\"https://www.frbsf.org/economic-research/publications/economic-letter/2022/june/policy-nimbleness-through-forward-guidance-speech/\">FRB</a></p> <p>一方、インフレ率は依然として高いままである。インフレは、おそらく経済の大幅な減速局面にならないと低下しない。問題となっているのが、（a）「インフレ率の急速な低下はありえるのか？」、（b）「アメリカ経済は、どこまで厳しい状況に陥るのか？」にある。FRBは「経済は穏やかに好転し、インフレ圧力は急速に低下するだろう。よって、急激な金利の引き締めは必要とされていない」との妄想じみた予測を行っている。</p> <p>経済の行く先がどれほど急転換するかについての判断を下すには、まだ時期尚早だろう。それでも、景気後退の兆しをあちこちで見ることができる。実際、不況は多くの人考えているより早く到来するかもしれない。<a href=\"https://theovershoot.co/p/how-worrying-is-the-q1-gdp-decline\">2020年第一四半期</a>だと、貿易データの一部は悪化しており、アメリカの実質GDPは縮小している。現在、広く引用されているアトランタ連銀のナウキャスティング（即時予測）モデルによるなら、アメリカ経済の第二四半期はマイナス成長になると予測されている。</p> <figure class=\"wp-block-image size-large\"><img loading=\"lazy\" width=\"1024\" height=\"798\" src=\"https://i0.wp.com/econ101.jp/wp-content/uploads/2022/07/E_F02.jpg?resize=1024%2C798&ssl=1\" alt=\"\" class=\"wp-image-48361\" srcset=\"https://i0.wp.com/econ101.jp/wp-content/uploads/2022/07/E_F02.jpg?resize=1024%2C798&ssl=1 1024w, https://i0.wp.com/econ101.jp/wp-content/uploads/2022/07/E_F02.jpg?resize=300%2C234&ssl=1 300w, https://i0.wp.com/econ101.jp/wp-content/uploads/2022/07/E_F02.jpg?resize=768%2C599&ssl=1 768w, https://i0.wp.com/econ101.jp/wp-content/uploads/2022/07/E_F02.jpg?resize=380%2C296&ssl=1 380w, https://i0.wp.com/econ101.jp/wp-content/uploads/2022/07/E_F02.jpg?resize=800%2C624&ssl=1 800w, https://i0.wp.com/econ101.jp/wp-content/uploads/2022/07/E_F02.jpg?resize=1160%2C904&ssl=1 1160w, https://i0.wp.com/econ101.jp/wp-content/uploads/2022/07/E_F02.jpg?w=1316&ssl=1 1316w\" sizes=\"(max-width: 1024px) 100vw, 1024px\" data-recalc-dims=\"1\" /><figcaption><strong>アトランタ連銀：即時GDP予測</strong></figcaption></figure> <p>出典：<a href=\"https://www.atlantafed.org/cqer/research/gdpnow\">アトランタ連銀</a></p> <p>以下の短い動画で、アトランタ連銀のパトリック・ヒギンズが即時予測モデルのロジックを説明している。</p> <figure class=\"wp-block-embed is-type-video is-provider-youtube wp-block-embed-youtube wp-embed-aspect-16-9 wp-has-aspect-ratio\"><div class=\"wp-block-embed__wrapper\"> <iframe loading=\"lazy\" title=\"What Is GDPNow?\" width=\"1200\" height=\"675\" src=\"https://www.youtube.com/embed/IpQzixSMjfs?feature=oembed\" frameborder=\"0\" allow=\"accelerometer; autoplay; clipboard-write; encrypted-media; gyroscope; picture-in-picture\" allowfullscreen></iframe> </div></figure> <p>アトランタ連銀が正しければ、我々はすでに自律的景気後退――つまり、四半期水準でGDPが２回連続して縮小している局面にいる可能性がある。大多数のエコノミストはこうした予測は行っていない。ドイツ銀行の調査によると、エコノミストの71％が、次の景気後退の到来は2023年になるだろう、と予測している。この予測では、2023年に景気後退が実際に起こっても、それは穏やかな景気後退――つまり四半期水準で２回続けての穏やかな景気後退に留まる――というのがコンセンサスであるようだ。ブルームバーグ通信のコンセンサス予想によるなら、アメリカ経済は2023年に全体として1.9％成長するとされている。これは肯定的な数値ではない。2022年春に予測されていた数値よりはるかに小さい数値だ。それでも、プラスであるだけマシな数値となっている。</p> <figure class=\"wp-block-image size-large\"><img loading=\"lazy\" width=\"1024\" height=\"836\" src=\"https://i0.wp.com/econ101.jp/wp-content/uploads/2022/07/E_F04.jpg?resize=1024%2C836&ssl=1\" alt=\"\" class=\"wp-image-48362\" srcset=\"https://i0.wp.com/econ101.jp/wp-content/uploads/2022/07/E_F04.jpg?resize=1024%2C836&ssl=1 1024w, https://i0.wp.com/econ101.jp/wp-content/uploads/2022/07/E_F04.jpg?resize=300%2C245&ssl=1 300w, https://i0.wp.com/econ101.jp/wp-content/uploads/2022/07/E_F04.jpg?resize=768%2C627&ssl=1 768w, https://i0.wp.com/econ101.jp/wp-content/uploads/2022/07/E_F04.jpg?resize=380%2C310&ssl=1 380w, https://i0.wp.com/econ101.jp/wp-content/uploads/2022/07/E_F04.jpg?resize=800%2C653&ssl=1 800w, https://i0.wp.com/econ101.jp/wp-content/uploads/2022/07/E_F04.jpg?resize=1160%2C947&ssl=1 1160w, https://i0.wp.com/econ101.jp/wp-content/uploads/2022/07/E_F04.jpg?w=1310&ssl=1 1310w\" sizes=\"(max-width: 1024px) 100vw, 1024px\" data-recalc-dims=\"1\" /><figcaption><strong>2023年GDP成長率のコンセンサス予測</strong></figcaption></figure> <p>出典：<a href=\"https://thedailyshot.com/2022/06/30/recession-risks-mount/\">Daily Shot</a> NB：ニュースレター「Daily Shot」の素晴らしさは、いくら誇張しても誇張しすぎることはない。購読する余裕があるなら、なけなしのお金でも支払う価値がある。</p> <p>一方、景気後退がすでに進行しつつつあることを示すリアルタイムの証拠が蓄積されつつある。アメリカの巨大な住宅市場では、住宅購入のための住宅ローンの申込みが先週大幅に現象し、現在は2021年比で24％減となっている。</p> <p>アメリカの消費者は、世界経済における最大の需要源であり、ヨーロッパの消費者と同じく、非常に悲観的なムードにある。ミシガン大学によって測定されている消費者心理は、2021年に急落している。現在、通常はあまりはっきりとした揺れを示さないコンファレンス・ボード指標も、マイナス方向に急落している。</p> <figure class=\"wp-block-image size-large\"><img loading=\"lazy\" width=\"1024\" height=\"582\" src=\"https://i0.wp.com/econ101.jp/wp-content/uploads/2022/07/E_F05.jpg?resize=1024%2C582&ssl=1\" alt=\"\" class=\"wp-image-48363\" srcset=\"https://i0.wp.com/econ101.jp/wp-content/uploads/2022/07/E_F05.jpg?resize=1024%2C582&ssl=1 1024w, https://i0.wp.com/econ101.jp/wp-content/uploads/2022/07/E_F05.jpg?resize=300%2C171&ssl=1 300w, https://i0.wp.com/econ101.jp/wp-content/uploads/2022/07/E_F05.jpg?resize=768%2C437&ssl=1 768w, https://i0.wp.com/econ101.jp/wp-content/uploads/2022/07/E_F05.jpg?resize=380%2C216&ssl=1 380w, https://i0.wp.com/econ101.jp/wp-content/uploads/2022/07/E_F05.jpg?resize=800%2C455&ssl=1 800w, https://i0.wp.com/econ101.jp/wp-content/uploads/2022/07/E_F05.jpg?resize=1160%2C660&ssl=1 1160w, https://i0.wp.com/econ101.jp/wp-content/uploads/2022/07/E_F05.jpg?w=1456&ssl=1 1456w\" sizes=\"(max-width: 1024px) 100vw, 1024px\" data-recalc-dims=\"1\" /></figure> <p><a href=\"https://news.gallup.com/poll/394190/gas-prices-squeezing-americans-rate-economy-poor.aspx\">ギャラップ社</a>がまとめた景気動向指標は、2008年の金融危機以来の最低水準にある。</p> <figure class=\"wp-block-image size-large\"><img loading=\"lazy\" width=\"1024\" height=\"603\" src=\"https://i0.wp.com/econ101.jp/wp-content/uploads/2022/07/E_F06.jpg?resize=1024%2C603&ssl=1\" alt=\"\" class=\"wp-image-48364\" srcset=\"https://i0.wp.com/econ101.jp/wp-content/uploads/2022/07/E_F06.jpg?resize=1024%2C603&ssl=1 1024w, https://i0.wp.com/econ101.jp/wp-content/uploads/2022/07/E_F06.jpg?resize=300%2C177&ssl=1 300w, https://i0.wp.com/econ101.jp/wp-content/uploads/2022/07/E_F06.jpg?resize=768%2C452&ssl=1 768w, https://i0.wp.com/econ101.jp/wp-content/uploads/2022/07/E_F06.jpg?resize=380%2C224&ssl=1 380w, https://i0.wp.com/econ101.jp/wp-content/uploads/2022/07/E_F06.jpg?resize=800%2C471&ssl=1 800w, https://i0.wp.com/econ101.jp/wp-content/uploads/2022/07/E_F06.jpg?resize=1160%2C683&ssl=1 1160w, https://i0.wp.com/econ101.jp/wp-content/uploads/2022/07/E_F06.jpg?w=1456&ssl=1 1456w\" sizes=\"(max-width: 1024px) 100vw, 1024px\" data-recalc-dims=\"1\" /><figcaption><strong>ギャラップ社「景気動向指標」</strong></figcaption></figure> <p>新しいトレンドに突入したと判断するには時期尚早だが、アメリカの個人消費は先々月の５月には実質ベースで減少し、年率換算で13兆896億ドルになったと推定される。</p> <figure class=\"wp-block-image size-large\"><img loading=\"lazy\" width=\"1024\" height=\"813\" src=\"https://i0.wp.com/econ101.jp/wp-content/uploads/2022/07/E_F07.jpg?resize=1024%2C813&ssl=1\" alt=\"\" class=\"wp-image-48365\" srcset=\"https://i0.wp.com/econ101.jp/wp-content/uploads/2022/07/E_F07.jpg?resize=1024%2C813&ssl=1 1024w, https://i0.wp.com/econ101.jp/wp-content/uploads/2022/07/E_F07.jpg?resize=300%2C238&ssl=1 300w, https://i0.wp.com/econ101.jp/wp-content/uploads/2022/07/E_F07.jpg?resize=768%2C610&ssl=1 768w, https://i0.wp.com/econ101.jp/wp-content/uploads/2022/07/E_F07.jpg?resize=380%2C302&ssl=1 380w, https://i0.wp.com/econ101.jp/wp-content/uploads/2022/07/E_F07.jpg?resize=800%2C635&ssl=1 800w, https://i0.wp.com/econ101.jp/wp-content/uploads/2022/07/E_F07.jpg?resize=1160%2C921&ssl=1 1160w, https://i0.wp.com/econ101.jp/wp-content/uploads/2022/07/E_F07.jpg?w=1318&ssl=1 1318w\" sizes=\"(max-width: 1024px) 100vw, 1024px\" data-recalc-dims=\"1\" /><figcaption><strong>アメリカの実質個人支出</strong></figcaption></figure> <p>総需要のもう一つの主要な源泉は、アメリカ政府の政府支出である。2020年、2021年の景気刺激策を経て、今や財政政策は〔支出減によって〕アメリカ経済の足を引っ張っている。</p> <figure class=\"wp-block-image size-large\"><img loading=\"lazy\" width=\"1024\" height=\"878\" src=\"https://i0.wp.com/econ101.jp/wp-content/uploads/2022/07/E_F08.jpg?resize=1024%2C878&ssl=1\" alt=\"\" class=\"wp-image-48366\" srcset=\"https://i0.wp.com/econ101.jp/wp-content/uploads/2022/07/E_F08.jpg?resize=1024%2C878&ssl=1 1024w, https://i0.wp.com/econ101.jp/wp-content/uploads/2022/07/E_F08.jpg?resize=300%2C257&ssl=1 300w, https://i0.wp.com/econ101.jp/wp-content/uploads/2022/07/E_F08.jpg?resize=768%2C659&ssl=1 768w, https://i0.wp.com/econ101.jp/wp-content/uploads/2022/07/E_F08.jpg?resize=380%2C326&ssl=1 380w, https://i0.wp.com/econ101.jp/wp-content/uploads/2022/07/E_F08.jpg?resize=800%2C686&ssl=1 800w, https://i0.wp.com/econ101.jp/wp-content/uploads/2022/07/E_F08.jpg?resize=1160%2C995&ssl=1 1160w, https://i0.wp.com/econ101.jp/wp-content/uploads/2022/07/E_F08.jpg?w=1252&ssl=1 1252w\" sizes=\"(max-width: 1024px) 100vw, 1024px\" data-recalc-dims=\"1\" /><figcaption><strong>財政支出の影響計測</strong></figcaption></figure> <p>出典：<a href=\"https://www.brookings.edu/interactives/hutchins-center-fiscal-impact-measure/\">ブルッキングス研究所</a></p> <p>FRBの地域部門による製造業に関する調査は現在、全ての方向でマイナスとなっている。</p> <figure class=\"wp-block-image size-large\"><img loading=\"lazy\" width=\"744\" height=\"1024\" src=\"https://i0.wp.com/econ101.jp/wp-content/uploads/2022/07/E_F09.jpg?resize=744%2C1024&ssl=1\" alt=\"\" class=\"wp-image-48367\" srcset=\"https://i0.wp.com/econ101.jp/wp-content/uploads/2022/07/E_F09.jpg?resize=744%2C1024&ssl=1 744w, https://i0.wp.com/econ101.jp/wp-content/uploads/2022/07/E_F09.jpg?resize=218%2C300&ssl=1 218w, https://i0.wp.com/econ101.jp/wp-content/uploads/2022/07/E_F09.jpg?resize=768%2C1058&ssl=1 768w, https://i0.wp.com/econ101.jp/wp-content/uploads/2022/07/E_F09.jpg?resize=380%2C523&ssl=1 380w, https://i0.wp.com/econ101.jp/wp-content/uploads/2022/07/E_F09.jpg?resize=800%2C1102&ssl=1 800w, https://i0.wp.com/econ101.jp/wp-content/uploads/2022/07/E_F09.jpg?w=928&ssl=1 928w\" sizes=\"(max-width: 744px) 100vw, 744px\" data-recalc-dims=\"1\" /><figcaption><strong>製造業関連指標</strong></figcaption></figure> <p>アメリカの鉄道に目を向けると、鉄鋼、木材、製紙など、製造業に必要な循環的な投入物の輸送重量は、近年観察された水準を遥かに下回るものとなっている。</p> <figure class=\"wp-block-image size-large\"><img loading=\"lazy\" width=\"1024\" height=\"686\" src=\"https://i0.wp.com/econ101.jp/wp-content/uploads/2022/07/E_F11.jpg?resize=1024%2C686&ssl=1\" alt=\"\" class=\"wp-image-48368\" srcset=\"https://i0.wp.com/econ101.jp/wp-content/uploads/2022/07/E_F11.jpg?resize=1024%2C686&ssl=1 1024w, https://i0.wp.com/econ101.jp/wp-content/uploads/2022/07/E_F11.jpg?resize=300%2C201&ssl=1 300w, https://i0.wp.com/econ101.jp/wp-content/uploads/2022/07/E_F11.jpg?resize=768%2C515&ssl=1 768w, https://i0.wp.com/econ101.jp/wp-content/uploads/2022/07/E_F11.jpg?resize=380%2C255&ssl=1 380w, https://i0.wp.com/econ101.jp/wp-content/uploads/2022/07/E_F11.jpg?resize=800%2C536&ssl=1 800w, https://i0.wp.com/econ101.jp/wp-content/uploads/2022/07/E_F11.jpg?resize=1160%2C778&ssl=1 1160w, https://i0.wp.com/econ101.jp/wp-content/uploads/2022/07/E_F11.jpg?w=1456&ssl=1 1456w\" sizes=\"(max-width: 1024px) 100vw, 1024px\" data-recalc-dims=\"1\" /><figcaption><strong>循環積載での鉄道の輸送重量</strong></figcaption></figure> <p>金融市場では、景気後退の確信が高まりつつあり、長期の米国債は魅力的な金融商品となっているため（長期国債はインフレによって価値が減じる可能性が低い）、短期国債と長期国債の間のイールドスプレッドは縮小傾向にある。</p> <figure class=\"wp-block-image size-large\"><img loading=\"lazy\" width=\"1024\" height=\"897\" src=\"https://i0.wp.com/econ101.jp/wp-content/uploads/2022/07/E_F12.jpg?resize=1024%2C897&ssl=1\" alt=\"\" class=\"wp-image-48369\" srcset=\"https://i0.wp.com/econ101.jp/wp-content/uploads/2022/07/E_F12.jpg?resize=1024%2C897&ssl=1 1024w, https://i0.wp.com/econ101.jp/wp-content/uploads/2022/07/E_F12.jpg?resize=300%2C263&ssl=1 300w, https://i0.wp.com/econ101.jp/wp-content/uploads/2022/07/E_F12.jpg?resize=768%2C673&ssl=1 768w, https://i0.wp.com/econ101.jp/wp-content/uploads/2022/07/E_F12.jpg?resize=380%2C333&ssl=1 380w, https://i0.wp.com/econ101.jp/wp-content/uploads/2022/07/E_F12.jpg?resize=800%2C701&ssl=1 800w, https://i0.wp.com/econ101.jp/wp-content/uploads/2022/07/E_F12.jpg?w=1068&ssl=1 1068w\" sizes=\"(max-width: 1024px) 100vw, 1024px\" data-recalc-dims=\"1\" /><figcaption><strong>10年国債と2年国債のスプレッド</strong></figcaption></figure> <p>FRBは、世界の中央銀行の本尊だが、それでも世界中の中央銀行が金融引き締めに転じれば、一般的にアメリカ企業に負の影響を与えるだろう。今後数ヶ月の間に、アメリカの購買担当者景況指標（PMI）の大幅な低下が当然のように観察されると思われる。</p> <figure class=\"wp-block-image size-large\"><img loading=\"lazy\" width=\"1024\" height=\"651\" src=\"https://i0.wp.com/econ101.jp/wp-content/uploads/2022/07/E_F13.jpg?resize=1024%2C651&ssl=1\" alt=\"\" class=\"wp-image-48370\" srcset=\"https://i0.wp.com/econ101.jp/wp-content/uploads/2022/07/E_F13.jpg?resize=1024%2C651&ssl=1 1024w, https://i0.wp.com/econ101.jp/wp-content/uploads/2022/07/E_F13.jpg?resize=300%2C191&ssl=1 300w, https://i0.wp.com/econ101.jp/wp-content/uploads/2022/07/E_F13.jpg?resize=768%2C488&ssl=1 768w, https://i0.wp.com/econ101.jp/wp-content/uploads/2022/07/E_F13.jpg?resize=380%2C242&ssl=1 380w, https://i0.wp.com/econ101.jp/wp-content/uploads/2022/07/E_F13.jpg?resize=800%2C509&ssl=1 800w, https://i0.wp.com/econ101.jp/wp-content/uploads/2022/07/E_F13.jpg?resize=1160%2C738&ssl=1 1160w, https://i0.wp.com/econ101.jp/wp-content/uploads/2022/07/E_F13.jpg?w=1456&ssl=1 1456w\" sizes=\"(max-width: 1024px) 100vw, 1024px\" data-recalc-dims=\"1\" /><figcaption><strong>「購買担当者景況指標（PMI）」と「世界的な金融政策サイクル」との比較</strong></figcaption></figure> <p>ロシアによるウクライナ侵攻の衝撃は、世界の関心をエネルギーと食料価格に集中させた。このため、世界はインフレの波に直面しているという印象が強まっている。しかし、景気循環では、工業用金属の価格が重要な指標となることが多い。銅は、<a href=\"https://www.bloomberg.com/news/articles/2022-07-01/copper-extends-losses-after-quarterly-slump-on-recession-fears?sref=wOrDP8KX\">経済学の博士号を持っているコモディティ</a>と呼ばれるが、大きく売られており、今日、17ヶ月ぶりの安値をつけた。</p> <figure class=\"wp-block-image size-large\"><img loading=\"lazy\" width=\"1024\" height=\"717\" src=\"https://i0.wp.com/econ101.jp/wp-content/uploads/2022/07/E_F14.jpg?resize=1024%2C717&ssl=1\" alt=\"\" class=\"wp-image-48371\" srcset=\"https://i0.wp.com/econ101.jp/wp-content/uploads/2022/07/E_F14.jpg?resize=1024%2C717&ssl=1 1024w, https://i0.wp.com/econ101.jp/wp-content/uploads/2022/07/E_F14.jpg?resize=300%2C210&ssl=1 300w, https://i0.wp.com/econ101.jp/wp-content/uploads/2022/07/E_F14.jpg?resize=768%2C538&ssl=1 768w, https://i0.wp.com/econ101.jp/wp-content/uploads/2022/07/E_F14.jpg?resize=380%2C266&ssl=1 380w, https://i0.wp.com/econ101.jp/wp-content/uploads/2022/07/E_F14.jpg?resize=800%2C560&ssl=1 800w, https://i0.wp.com/econ101.jp/wp-content/uploads/2022/07/E_F14.jpg?resize=1160%2C812&ssl=1 1160w, https://i0.wp.com/econ101.jp/wp-content/uploads/2022/07/E_F14.jpg?w=1228&ssl=1 1228w\" sizes=\"(max-width: 1024px) 100vw, 1024px\" data-recalc-dims=\"1\" /><figcaption><strong>コモディティ：エネルギーと金属</strong></figcaption></figure> <p>全体的に、見通しは暗いと言えるだろう。〔経済の先行きで〕<a href=\"https://www.ft.com/content/67c0096e-230f-44cb-8277-2001ae46795b\">ソフトランディング</a>は難しいと考える人が増えてきている。しかし、まだ判断を下すには時期尚早だ。インフレを抑制するために、経済を減速させることが目的とされているのなら、現状はまさにその立証となってしまっている。現時点では、様々な景気後退の要因がどのように相互作用するのかにかかっている。そして相互作用によって本当に厳しい局面になるかどうかはまだ未知数だ。</p> <p>Article URL: <a href=\"https://econ101.jp/アダム・トゥーズ「アメリカ経済は大規模な景気/\">https://econ101.jp/アダム・トゥーズ「アメリカ経済は大規模な景気/</a></p> </blockquote>","date_published":"2022-07-03T17:25:05.000Z"},{"id":"https://builtin.com/software-engineering-perspectives/how-conduct-technical-interview","url":"https://builtin.com/software-engineering-perspectives/how-conduct-technical-interview","title":"Conducting a Technical Interview: Everything You Should Know","content_html":"<blockquote> <p><a href=\"https://lobste.rs/\">Lobsters</a> <strong>Conducting a Technical Interview: Everything You Should Know</strong></p> <p>by deejayy@users.lobste.rs (deejayy) <i>#practices</i></p> <p><a href=\"https://lobste.rs/s/nummis/conducting_technical_interview\">Comments</a></p> <p>Article URL: <a href=\"https://builtin.com/software-engineering-perspectives/how-conduct-technical-interview\">https://builtin.com/software-engineering-perspectives/how-conduct-technical-interview</a></p> </blockquote>","date_published":"2022-07-03T17:14:14.000Z"},{"id":"https://okuranagaimo.blogspot.com/2022/07/blog-post_3.html","url":"https://okuranagaimo.blogspot.com/2022/07/blog-post_3.html","title":"気候変動はワインの化学反応を変化させる","content_html":"<blockquote> <p><a href=\"https://okuranagaimo.blogspot.com/\">ブログ</a> <strong>気候変動はワインの化学反応を変化させる</strong></p> <p>by Unknown <i>#Climate change</i> <i>#News</i></p> <p><a href=\"https://arstechnica.com/science/2022/06/climate-change-is-altering-the-chemistry-of-wine/\">ars technicaより</a>。</p><blockquote class=\"ref\"><p>温暖化、山火事、予測不可能な天候がワイン醸造プロセスを混乱させている。</p> <p>BY ウラ・クロバック、カタリーナ・ジマー</p> <p>2020年9月、カリフォルニア州ナパバレーで発生した大火災「グラスファイア」の直後、ワイン化学者のアニタ・オバーホルスターの受信箱は、パニックに陥ったブドウ栽培者たちからの何百通ものメールで溢れかえっていた。彼らは、ワインに恐ろしい影響 — スモークテイストと呼ばれる灰皿のような風味を与えることなく、ブドウを収穫できるかどうかを知りたがっていた。</p> <p>カリフォルニア大学デービス校のオバーホルスターは、彼らに「たぶん」としか言えなかった。</p> <p>業界の研究所はブドウのサンプル検査に殺到し、最大で6週間も待たされた。生産者は、収穫する価値があるかどうかを分からない状態だった。2020年のカリフォルニアワイン用ブドウの8%は腐敗したまま放置されていた。</p> <p>ワインメーカーは、<a href=\"https://knowablemagazine.org/article/food-environment/2022/lifetime-climate-change\">気候変動</a>によって引き起こされた移り変わりを知らないわけではない。涼しい地域では、気温の上昇によってブドウの実が熟すという恩恵を受けているところもあるが、逆に壊滅的な被害を被っているところもある。ヨーロッパ、北アメリカ、オーストラリアなどでは、猛暑による熱波や<a href=\"https://knowablemagazine.org/article/physical-world/2019/what-are-california-megafires-things-know\">山火事</a>など、気候変動による災害が収穫を台無しにしている。</p> <p>そして、2020年に示されたように、気候変動は直接的にブドウを破壊することなく、ブドウに被害を与える可能性がある。ワインの品質とアイデンティティは、ブドウのデリケートな化学反応と栽培条件に左右されるため、山火事や気温の上昇はワインの風味を一変させる可能性がある。多くの生産者やワインメーカーは、気候変動がワインの特徴的な風味を奪い、ヴィンテージを完全に台無しにしてしまうのではないかと心配している。</p> <p>ナパ・バレー在住のワイン専門家で、『The Wine Bible』の著者であるカレン・マクニールは、「これは大きな心配事です」と言う。「ワインの鼓動はその土地と結びついているのです。」</p> <p><a href=\"https://knowablemagazine.org/article/food-environment/2022/history-climate-change-offers-clues-earths-future\">気候変動</a>がワイン醸造にもたらす最大の課題は、予測不可能なことだとマクニールは言う。かつては、生産者はどの品種をどのように栽培し、いつ収穫し、どのように発酵させれば安定した品質のワインができるかを知っていたが、現在ではすべてのステップが不確実なものとなっている。このような認識の高まりから、研究者やワインメーカーは、温暖化で変化する気まぐれな環境の中で、愛されるブドウの品種とその独特の品質を維持する方法を見つけることに拍車をかけている。</p> <p>そこで、私たちは、気候変動が伝統的なブドウの木やワインをどのように破壊しているのか、フランスのボルドーとカリフォルニアの2つの有名なワイン産地のワイン専門家に話を聞き、そして、2021年後半にカリフォルニア大学デービス校とその近くのナパ・バレーで、科学者、生産者、ワインメーカーに話を聞いた。</p> <p>ワイン醸造の各工程で、求められる味と香りを維持するためにどのような工夫がなされているのか、その内幕を知ることができた。そして、最高級のカベルネ・ソーヴィニヨンから、煙や灼熱で台無しになったサンプルまで、たくさんのワインを試飲することができた。</p> <h3>気候変動の味</h3> <p>異常気象は、最も丈夫なブドウの木でさえ枯らしてしまうが、気候の脅威の多くは、目に見えない実の化学変化である。</p> <p>なぜなら、ワインの品質は、細かいところでは、糖、酸、二次化合物の3つのバランスが重要である。ブドウの木が光合成を行うことで、糖が実に蓄積され、ブドウが熟すことで酸が分解される。二次化合物とは基本的には、植物のコア代謝に不可欠な化学物質以外のもので、季節を通じて蓄積される。アントシアニンと呼ばれる物質は、赤ブドウに色を与え、紫外線から植物を保護する。また、タンニンはワインに苦味や渋み、ドライな口当たりを与え、ブドウの木は放牧された動物や害虫から身を守る役割を担っている。</p> <p>これらの3つの要素、つまりワインの風味は、土壌の種類、降雨量、霧など多くの環境要因に影響されるため、フランス語の「テロワール」という言葉に包括されている。気候は、気温と降水量の長期的なパターンであり、テロワールの最大の要素であるとオーバーホルスターは言う。</p> <p>カリフォルニア大学デービス校でブドウ栽培を研究している植物生物学者、メーガン・バートレットは、地域の気候が変化すると、生育期間中に糖、酸、二次化合物の生成速度が変化し、そのバランスが崩れる可能性があると言う。ブドウは他の果物同様に、熟すにつれて酸を分解し、糖を蓄積する。気温が高いと熟成が促進され、レーズンのような甘い風味を持つブドウができる。</p> <p>酵母は発酵中にその糖分を消費してアルコールを排出するため、より甘い果実を発酵させるとワインの<a href=\"https://www.euractiv.com/section/agriculture-food/news/frances-languedoc-winegrowers-are-already-adapting-to-climate-change/\">アルコール度数が高くなり</a>、実際、南フランスのような温暖な地域のワインはよりアルコール度数が高くなっている。ボルドーワイン協会の広報担当者であるセシル・ハは、この傾向は、特に酸の低下を伴うため、この地域の消費者にとって好ましくない傾向である、と言う。酸味は新鮮なフルーティーさをもたらし、ワインがセラーで何年も持つことを保証する。</p> <blockquote class=\"tweet\"><p>温暖化でワインの化学的性質が変化する理由</p> <p>糖分</p><p>気温が高いと果実は早く熟し、より多くの糖分が蓄積されるため、アルコール度数が高くなる。</p> <p>酸</p><p>ワインにフレッシュさと酸味を与える酸性度は、温暖な気候では減少する。</p> <p>二次化合物</p><p>アントシアニンという色素は、熱で分解される。ワインの口当たりに重要なタンニンは、糖分が上昇を抑えるためにブドウを早く収穫した場合、十分に発達しない可能性がある。</p></blockquote> <p>ワインによって、高いアルコールが焦げたような味を作り出し、微妙なアロマを隠してしまうことがある。ワシントン州立大学の食品科学者であるキャロリン・ロスは、「<a href=\"https://www.annualreviews.org/doi/abs/10.1146/annurev-food-030212-182707\">Annual Review of Food Science and Technology</a>」でワインのアロマ化合物を分類している。アルコール度数の高いワインは、よりスパイシーな味になる傾向がある。そして、暑くなるにつれて、「ジンファンデルのようなスタイルが好まれるようになります」とバートレットは言う。「ジンファンデルが好きならいいんです。しかし、ピノやキャブを植えてしまうと、その品種の良さを表現できなくなってしまうのです。」</p> <p>もし、この話が単に糖と酸の話であれば、解決策は比較的簡単である。甘くなり過ぎる前に、そして酸味が残っているうちに、早めにブドウを収穫するのだ。しかし、生産者は、二次化合物のシチューが蓄積されることを望んでいる。なぜなら、二次化合物は高品質のワインを生み出す鍵となる重層的なアロマを生み出すからである。そのため、ワイン生産者は、タンニンやアントシアニンが十分に発達していない状態で早めの収穫をするか、それらの化合物をたっぷり含んでいるが甘すぎる状態で、遅めの収穫をするかの選択を迫られることがある。</p> <p>すべてが同じであれば、気温の上昇によるブドウの変化は、ワインに熟した風味、つまり「調理された」風味をもたらす。マクニールはその変化を次のように表現している。「未熟なチェリー、ほぼ熟したチェリー、熟したチェリー、チェリージュース、パイを作るようにストーブの上で煮詰めたチェリー、レーズンに近いドライチェリー。」温暖な地域で作られるワインには、多くのワインがレーズン風味になることで、その土地の感覚を失う危険性があるため、気候変動は懸念される。(「レーズンの味はどれも同じです」とマクニールは言う。)</p> <p>気温が上昇し、天候が不安定になり、栽培技術の交流が盛んになったことで、ワイン間の曖昧さは、すでに業界に影響を受けている。そのため、マスターソムリエの認定 — ワインの品種、年、産地を当てるという非常に難しい試験 — はさらに難しくなっている。</p> <p>「年配のワインマスターやマスターソムリエの中には、今の試験、特にテイスティング試験を受けなければならないとしたら、絶対に合格しないだろうと言う人がたくさんいます」とマクニールは言う。</p> <h3>火の味</h3> <p>このようなワインの風味の変化は、気候がもたらす恐ろしい影響である、スモークテイストと比較すると、微妙である。例えば、樽熟成によるスモーキーな香りがワインを引き立てるかも知れないが、オーバーホルスターが表現するように、これは「喉の奥にある灰皿のような特徴」で、「バンドエイド」や「薬」<a href=\"https://www.ajevonline.org/content/70/4/373.abstract\">のような</a>ニュアンスがある。</p> <p>木材を燃やしたときに発生する揮発性フェノールという化合物がブドウに浸透し、主に果皮に蓄積される。このフェノールは糖と結合してグリコシドと呼ばれる無臭の化合物になるが、発酵が進と一部が遊離し、独特の強い風味が生まれる(瓶や樽、口の中で分解される)。この味は、古いスモークではなく、新鮮なスモークを実に当てたときに最も顕著に現れる。</p> <p>この現象は、ワインを舌の上に乗せると、香りが副鼻腔に上がってくる「レトロネーザル」であり、20%から25%の人がそれを味わうことができないと言われている。これは、唾液に結合を切断してスモーキーな香りを放出する酵素がないためと考えられる。赤ワインはブドウの皮で発酵させるため、主に赤ワインにとっての脅威となる。</p> <p>気候変動によって悪化した最近の激しい山火事の急増により、ナパの生産者は毎年、は秋のブドウの収穫が近づくにつれて、不安に駆られている。2017年以降、ほとんどの年でナパのブドウ畑の上に重い煙が立ち込めている。心配したブドウ栽培者たちはオーバーホルスターに指導を求め、化学者は様々なレベルの煙にさらされた多数のテストバッチを発酵させた。</p> <p>私たちが彼女と会う日、オーバーホルスターは私たちをカリフォルニア大学デービス校のロバート・モンダヴィ研究所にある24,000本のワインを貯蔵するライブラリーに案内してくれた。彼女は棚から2本の赤ワインを探し出し、2020年のヴィンテージを私たちに手渡した。1つは、グラスファイアの煙に1週間さらされたブドウから作られた、適度に汚染されたワイン。もう1つは、同じ年にブドウ園のすぐそばまで迫った、落雷いをきっかけとする大規模火災の煙に耐えたブドウから作られた、ひどく汚染された発酵ワイン。</p> <p>その後、リノにあるウラのキッチンテーブルで、非公式だがブラインド・テイスティングを行なった。カークランド・シグネチャー・カベルネ・ソーヴィニヨンと比較すると、汚染されたワインにはキャンプファイヤーのようなスモーキーさがあり、カティアは主に匂いとして感じ、ウラも喉の奥が焼けるような感覚を覚える。</p> <p>ウラはスモーキーなヴィンテージの「焦げた木を飲む」とノートに書き留めている。</p> <h3>より丈夫なブドウの木を植える</h3> <p>スモーキー・テイストは、私たちのような素人にもその存在を知らしめるほど強烈である。しかし、多くのワインメーカーは、気候変動がワインの風味や個性を脅かすことを懸念している。温暖な地域の生産者と研究者は、ブドウ畑やワイン醸造、そしてブドウの木そのものを適応させる方法を学んでいる。</p> <p>例えばボルドーでは、赤ワインの伝統的なスタイルは、強い果実のアロマと「鉛筆の芯」のような土臭さを持つフルボディである。しかし、春が早いと、伝統的な品種のブドウは秋ではなく夏のピークに成熟するため、糖分が多く、酸が少なくなり、アロマも好ましくない変化が生じる。フランス国立農業食品環境研究所の農学者アニェス・デストラック・イルヴィヌと同僚たちは、温暖な気候に適応しながら、ボルドーの風味を持つワインを造るブドウの種類を特定するために、他の地域の52品種を10年にわたって研究し、最近その成果を発表した。</p> <p>ワイン生産者と協力し、4つの黒ブドウ品種と2つの白ブドウ品種が条件に適合することになった。伝統的なの種類に落ち着きました。そして、長い間6つの伝統的な赤と8つの伝統的な黒ブドウ6品種と白ブドウ8品種の栽培しか認めてこなかったフランス当局が、2021年に<a href=\"https://www.winemag.com/2021/02/08/bordeaux-grape-varieties-news/\">ボルドーのワイン生産者に、ブレンドワインの10パーセントを越えない範囲で新しい品種の栽培を正式に許可した</a>のは、驚くべきことである。</p> <p>デストラック・アーヴィンによると、これらの新種はワインメーカーのパレットに新鮮なツールを加え、ボルドーブレンドにおける気候変動の影響のバランスをとることができると言う。フランスの品種アリナルノアは酸味とタンニンのレベルを高め、ポルトガルのトウリガ・ナシオナルは、暑さに弱い品種が失う可能性のある力強い黒い果実のアロマを強調することができる。ボルドーワイン評議会のハは、「色数が多ければ、より多くの絵を描くことができるかも知れません」と言う。</p> <p>しかし、選ばれた6品種を承認するのはあくまで試験的なものに過ぎない。ボルドー科学農業研究所とブドウ・ワイン科学研究所の植物生理学者であるグレゴリー・ガンベッタは、2,000年以上にわたってブドウの木の育ててきたボルドーでは、新しい品種というのは恐ろしいものだと言う。伝統的な品種は、この地域の文化や歴史と非常に密接に絡み合っているので、「率直に言って、他の手段を使ってシステムを適合させることができれば、はるかに良いでしょう」と彼は言う。</p> <p>そこで、ガンベッタらはまさにそれを行おうとしている。異なる種類の台木を使用して、ブドウの木を気候に耐える方法を研究している。台木は植物の全体的な活力と水の使用をコントロールするもので、温暖化の世界に耐えられるように選べば、ブドウの独特の化学的性質や風味を決定する地上部の品種をそのまま使用して成長させることができるのだ。</p> <p>2021年11月のある晴れた暖かい日、カリフォルニア大学デービス校のブドウ栽培研究者カーン・クルトゥラルは、ナパバレーのオークヴィル実験ヴィンヤードにあるブドウ畑に案内してくれた。2016年以来、クルトゥラルらは、台木とカベルネ・ソーヴィニヨンのクローンの16のユニークな組み合わせを監視して、どの組み合わせが熱波や干ばつなどのストレスの多い条件下で最も回復力があり、かつ高品質のカベルネ・ソーヴィニヨンのブドウを生産できるかを調べている。</p> <p>実験用接木の中には、フランスの420Aと呼ばれる台木を使ったものがあるが、明らかに萎れており、わずか5年で枯れてしまったものもある。しかし、オーストリアの台木「コーバー5 BB」、フランスの「3309クーデルク」、「110リヒター」に接ぎ木されたものは、より元気で歯が茂っているように見える。</p> <p>ナパの著名なワイン生産者アンディ・ベックストファーは、クルトゥラルと共同で地震のブドウ園で同様の試験を行なっているが、この結果は今後数年間、カベルネ・ソーヴィニヨンに恩恵をもたらすと考えていると話す。「気候変動に対応し、かつワインの品質を向上させるような新しい組み合わせを生み出すといいのですが」と彼は言う。</p> <p>世界中の生産者はすでに、温暖化の影響を和らげるために、伝統的な慣習を変えつつある。ブドウは、過熟を防ぐため、また、火災の多い地域では山火事の季節を避け、煙の害を避けるために、<a href=\"https://climate.nasa.gov/news/2418/climate-change-is-shifting-wine-grape-harvests-in-france-and-switzerland/\">しばしば早い時期に収穫されることがよくある</a>。ボルドー地方の労働者は、酸味が最も高くなる早朝にブドウを収穫し、糖分の生成を抑えるために茂った植物を刈り込んでいる。</p> <p>オークヴィルの研究所で、クルトゥラルは、畝間に生える炭素を吸収する草や、様々な棚仕立てのワイヤーに縛られたブドウの木など、様々なブドウの栽培方法の効果を調べる実験を次々と見せてくれた。干ばつに悩まされているカリフォルニアのような場所にとって幸いなことに、解決策は単に水を増やすことではない。彼の研究によると、<a href=\"https://www.frontiersin.org/articles/10.3389/fpls.2021.712622/full\">最もバランスの取れた香り高いワインは、常に穏やかな水ストレス下にあるブドウの木から生まれる</a>のだそうだ。太陽の光と上手につき合うことが、より良い方法かも知れない。</p> <p>「スペクトルの中には、近赤外光のようなダメージを与える領域もあります」と彼は以前に説明した。近赤外光は植物と果実を温める。ブドウ園で、カベルネ・ソーヴィニヨンの木にパラソルのような遮光フィルムを2シーズンにかけて張っているところに案内してくれた。このフィルムは熟成プロセスを遅らせるが、ブドウの実の量には影響しないようだ。</p> <p>同じ旅先で、<a href=\"https://wineserver.ucdavis.edu/events/grapeday2021\">カリフォルニア大学デービス校のワイン研究会議</a>で、その違いを味わうことになった。そこで、クルトゥラルの大学院生であるローレン・マリグリアーノが、日光に完全にさらされたブドウと、様々な種類の日陰で保護されたブドウの化学分析について発表した。その後、研究者、生産者、ワインメーカーの聴衆に、3つの処理によるワインサンプルを提供し、試飲してもらった。</p> <p>私たちの周りでは、専門家たちがグラスを回し、匂いを嗅ぎ、一口飲んでから、小さなプラスチックのバケツに吐く。私たちもその様子を見ながら、そっと真似をしてみる。最初のワインはかなり苦く、2番目のワインはあまり複雑な味がしない。近くにいた専門家は、残念ながらそれを「四角い」と言った。3番目は、ベリーの香りが強く、味もなめらかで、参加者からは「丸みがある」を認めてつぶやいた。</p> <p>その「丸い」ものは、​​熱の伝わりやすい波長である近赤外光を約30パーセントをカットする遮光フィルムの下で栽培されたブドウから得られたものであることが分かった。このフィルムでブドウを冷やすことで、熱に弱いアントシアニンを、1番目と2番目のサンプルのブドウよりも高濃度に蓄積させることができた。一方は、別の波長をカットする効果の低い遮光フィルムを使用し、もう一方は全くフィルムを使用せずに栽培した。マリグリアーノは、このフィルムは日光に依存する化合物が蓄積するのに十分な光を通すので、よりコクのある、完全な赤ワインができると、説明する。</p> <p>しかし、農家がブドウの木の列に沿って長いフィルムを貼ることは、特に広大な土地では必ずしも経済的ではない。そこで、登場したのが、トレリスである。実験的なブドウ畑を見学していると、クルトゥラルは一時停止して、一本の高く垂れ下がったワイヤーに沿って蛇行するブドウの木の列を指差した。このトレリスは、ブドウの葉が果実に影を落とす、遮光膜のようなものだと説明した。</p> <p>遮光フィルムやブドウを遮るトレリスなどの栽培方法は、これまでオーストラリア、南米、イスラエル、スペインに限られていた。ナパ・バレーのワイン生産者スティーブ・マティアソンは、「気候変動により、温暖な気候のブドウ栽培に関する30年近い優れた研究が、ブルゴーニュ、ボジョレー、ドイツ、ナパ、ソノマといった地域にも突然、当てはまるようになりました」と言う。彼はまた、北東から南西の方向にブドウの木を植え、太陽がブドウの木の上に直接当たるようにし、果実を葉に守れるようにしている。</p> <p>「ナパは、一世代前まで涼しい気候の産地でした。」と彼は驚いている。</p> <h3>ワインにおける気候の影響を修復する</h3> <p>最も丈夫なブドウでも、極端な暑さや煙に耐えられるとは限らない。そのため、研究者やワイン生産者は、気候の影響を受けた作物をうまく付き合いながら、バランスの取れたワインを作る方法も開発している。</p> <p>オーバーホルスターは、2020年のカリフォルニアの大火事の後、収穫されずに残されたブドウの木の多くは、まだ良いワインを生産していた可能性があると考え、生産者に収穫の数週間前に小規模な「<a href=\"https://www.youtube.com/watch?v=D1KUuTPcmHo\">バケット発酵</a>」を行い、煙害を検査するよう勧めている。発酵によって、灰皿のような味のフェノール類が放出されているためである。その後、生産者はワインのサンプルをラボに送って分析し、マイクロバッチを自分で試飲することができる。ラボは限られた化合物しか検査しないので、商業的な研究所では見逃してしまうような変化も発見できるかも知れないし、そうでないワインでも問題ないと判断してしまう可能性がある。</p> <p>また、スモーキーなワインに少量のブドウの濃縮液を加えて甘くすることも有効だと、オーバーホルスターは言う。そうすれば、余分な糖分が口の中の酵素がブロックして、フェノールを放出させないからである。しかし、活性炭や逆浸透膜など、現在の処理方法ではスモーキーな化合物を幅広く対象としている。そのため、必然的に好ましい香りも消されてしまう。そこで、オーバーホルスターは食品・飲料業界で使われている酵素を調べ、ワインに含まれる好ましくない化合物を分解し、ろ過しやすくする酵素を探っている。</p> <p>また、ワインのブレンド技術も有効である。例えば、ベックストファーは、2020年の煙害を受けたブドウを発酵させ、汚染されていないワインとブレンドすると、「200ドルのワインには入らないかも知れませんが、その多くは40ドルのワインに入るかも知れません」と述べている。</p> <p>そして、マティアソンは、風味のバランスをとるために慎重に品種をブレンドしている。カベルネ・ソーヴィニヨンは、酸味を保つために早摘みするが、その分、舌にまとわりつくようなリッチさ、つまりミッドパレットが少なくなってしまう。そこで、プチ・ヴェルドというブドウを加えてミッドパレットを強化し、カベルネ・フランを加えてハーブの香りを補っている。</p> <p>彼はまた、カベルネ・ソーヴィニヨン種のブドウが、気温の高い夜に失ってしまうタンニンを豊富に含むサグランティーノ種も「20年先を見越して」緊急用の植えている。</p> <p>気温の上昇により、マティアソンの好むスタイルが脅かされている。現在人気のあるフルボディのワインよりも、アルコール度が低く、酸味の強いワインが好まれる。しかし、マティアソンは、レーズンのようなワインがどこにでもあるわけではないと考えている。実際、<a href=\"https://wine-economics.org/wp-content/uploads/2012/10/Vol.6-No.2-2011-Too-Much-of-a-Good-Thing-.pdf\">より強く、より甘いワインの増加は、ワイン醸造業者と消費者の需要による選択</a>であり、温暖化だけが原因ではない、とする研究もある。「私は、ワインメーカーが気候変動を理由に、熟し過ぎ、濃厚で、ジャミーなワインを造っていることを非常に不満を感じています」と彼は言う。</p> <p>ワイン醸造もまた、気候変動に対応するためにハイテク化が進んでいる。フランスでは、モンペリエ大学の微生物学者ファビエンヌ・レミーズが、発酵中のアルコール生成量が少なくする新しい酵母菌株を作り、糖分が多すぎる問題を回避している。また、カリウムなどのイオンを除去してワインの酸度を上げる電気透析プロセスも開発し、フランス、モロッコ、スペインのワインメーカーに採用されている。</p> <h3>ワインの未来</h3> <p>気候変動の影響を受けたワインと、研究者やワイン生産者が考え出した適応策に対する最大の疑問は、もちろん、「人々がそのワインを買い続け、楽しみ続けるかどうか?」ということである。</p> <p>消費者調査から得られた驚くべき教訓の1つは、クルトゥラルとガンベッタが指摘するように、より大胆でジャミーなワインが受け入れられていることである。ナパとボルドーの赤ワインに関するある研究では、過去60年間、これらの地域が温暖化しているにもかかわらず、<a href=\"https://oeno-one.eu/article/view/4774\">ワインの評価は実際に上昇している</a>ことが分かった。この発見は<a href=\"https://link.springer.com/article/10.1007/s10584-005-4704-2\">、生育期の平均気温が17.3度で品質がピークに達する</a>という以前の予測を覆すもものである、と両氏は書いており、この予測は、両地域ともとっくに超えている。</p> <p>それでも、クルトゥラルとガンベッタは、気温の上昇が生産者の適応能力を超えて二次化合物を消耗する転換点に到達している可能性があるとも指摘している。「正直なところ、最適な温度とは何なのか分かりません。どこまでが最適なのか、優れたツールや分析が必要です」とガンベッタは言う。</p> <p>マティアソンは、上質なワインは温暖化した気候を乗り越えられると考えている。遮光布、ブレンド技術、そして、非常用のサグランティーノの貯蔵で、彼は次に来るものに備えている。「私たちは適応できると思います」と彼は言う。「短期的には、私たちの学習のペースは、気候変動のペースよりも速いです。」</p> <p><a href=\"https://arstechnica.com/science/2022/06/climate-change-is-altering-the-chemistry-of-wine/%E2%80%9Chttp://dx.doi.org/10.1146/knowable-062222-1%E2%80%9D\">DOI: 10.1146/knowable-062222-1</a> (<a href=\"https://arstechnica.com/science/2022/06/climate-change-is-altering-the-chemistry-of-wine/%E2%80%9Chttp://arstechnica.com/science/news/2010/03/dois-and-their-discontents-1.ars%E2%80%9D\">About DOIs</a>)</p></blockquote> <p>Article URL: <a href=\"https://okuranagaimo.blogspot.com/2022/07/blog-post_3.html\">https://okuranagaimo.blogspot.com/2022/07/blog-post_3.html</a></p> </blockquote>","date_published":"2022-07-03T17:05:17.030Z"},{"id":"https://okuranagaimo.blogspot.com/2022/07/blog-post.html","url":"https://okuranagaimo.blogspot.com/2022/07/blog-post.html","title":"人生は短くない","content_html":"<blockquote> <p><a href=\"https://okuranagaimo.blogspot.com/\">ブログ</a> <strong>人生は短くない</strong></p> <p>by Unknown <i>#Life</i></p> <p><a href=\"https://dkb.show/post/life-is-not-short\">DKB Showより</a>。</p><blockquote class=\"ref\"><blockquote class=\"ref\">最も驚くべきことは、あなたは自分の財産を誰にも盗ませないのに、限りなく価値のある自分の時間は、一貫して人に盗ませるということです。時間というものは、限りなく貴重です。 </blockquote> <p>良い人生を送る方法を学びたいなら、セネカ(<a href=\"https://ja.wikipedia.org/wiki/%E3%83%AB%E3%82%AD%E3%82%A6%E3%82%B9%E3%83%BB%E3%82%A2%E3%83%B3%E3%83%8A%E3%82%A8%E3%82%A6%E3%82%B9%E3%83%BB%E3%82%BB%E3%83%8D%E3%82%AB\">ルキウス・アンナエウス・セネカ</a>)に勝る情報源はほとんどありません。マルクス・アウレリウスやエピクテトスと並んで、最も人気のある<a href=\"https://ja.wikipedia.org/wiki/%E3%82%B9%E3%83%88%E3%82%A2%E6%B4%BE\">ストア派</a>哲学者の一人です。</p> <p>彼の人生はクレイジーなほど浮き沈みに満ちていました。彼は高貴の家に生まれ、いくつかの影響力のある劇を書き、8年間島に流され、ローマ皇帝の最高顧問になり、死刑を宣告され、強制的に自殺させられました。</p> <p>その間に、彼は膨大な数の哲学を行いました。</p> <p>このインタビューでは、人生の短さについて、そして限られた時間を如何に過ごすのが最善かについて、セネカに話を聞きます。</p> <p>(これは、セネカのエッセイ「人生の短さについて」を基にした、フィクションでありながら、リアルなインタビューです。セネカの回答は、直接の引用か、彼の著作に基づくものです。各回答の元の文脈が分かるように、引用が含まれています。)</p> <hr> <p><b>DKB: 人が自分の人生で犯す最大の過ちは何だと思いますか? 私たちは一貫して何を間違えているのでしょうか?</b></p> <p>セネカ: 誰もが人生は短いと不平を言いますが、その見方は間違っています。人生は短くありません。本当の問題は、私たちがその多くを無駄にしているということです。</p> <p>人生は、見果てぬ夢を実現するのに十分に長いのです。ただ、あなたはそれを無駄にすることに忙しく、しっかり生きることなく人生を終えてしまうのです。<sup>1</sup></p> <p>最も驚くべきことは、あなたは自分の財産を誰にも盗ませないのに、限りなく価値のある自分の時間を、一貫して人に盗ませているということです。<sup>2</sup></p> <p>お金を無造作に配る人はいませんが、あなたは自分の時間をまさにそうしているのです。あなたは物理的な所有物には倹約家ですが、時間に関しては、世界で唯一倹約すべきものを浪費しているのです。<sup>3</sup></p> <p>たとえ千年の命があったとしても、あなたにとっては短いと感じるでしょう。なぜなら、気が散ることや突発的に起こることが、あなたの持っている時間を飲み込んでしまうからです。<sup>4</sup></p> <p><b>DKB: 確かに私たちは多くの時間を浪費しています。なぜそうなるのでしょうか? 私たちは皆、自分の時間が限られていることを知っていますが、多くの人がこの基本的な間違いを犯し続けているのです。</b></p> <p>セネカ: あなたは心の中で、自分は永遠に生きられると純粋に思っているからです。時間が無限にあると思い込んでいて、あまり考えずに最初に思い付いたことに時間を使い続けているのです。</p> <p>あなたは恐れることでは死者のように振る舞い、欲することには不死者のように振る舞います。<sup>5</sup></p> <p>時間は触れたり感じたりすることができないので、時間を本当に把握するのは難しいのです。もし、あなたが医者から致命的な病気だと言われたら、生き続けるために全財産を注ぎ込むでしょう。それくらい、あなたにとって時間の価値は大きいのです。しかし、日常では、それが見えないという理由だけで、まったく価値のないもののように扱ってしまいます。<sup>6</sup></p> <p>さらに悪いことに、人は繰り延べられた人生設計を思い付くものです。「40歳になったら引退して本を書こう」とか、「今は嫌いなことをやってお金を稼いで、10年後には本当に好きなことをやろう」とか言うのです。</p> <p>本気ですか? 宇宙があなたの人生を思い通りに進めさせようとしているとでも思っているのですか? その年齢まで生きられる保証があるのですか?</p> <p>将来のために物事を先延ばしにするのは、人生の最大の浪費です。未来に約束することで、現在の自分を否定しているのです。自分ではどうしようもない未来に頼り、唯一コントロールできる現在を放棄しているのです。</p> <p>未来はすべて不確実なものの中にあります — 今を生きましょう。<sup>7</sup></p> <p><b>DKB: 公平のために言うと、状況によっては、先延ばしされた人生設計が正当に必要になるかも知れません。厳しい経済状況に対処しなければならないため、夢を追うのを遅らせる必要があるかもしれません。</b></p> <p>セネカ: それは正しい指摘です。しかし、あなたの時間は有限であり、あなたは旅ではなく、最終地点にしか関心がない道に時間を費やしていることを認識する必要があります。</p> <p>本当に避けるべき失敗は、自分に喜びをもたらさない道を意図的に追求することです。偉大な皇帝アウグストゥスを例にとってみましょう。彼は世界一の権力者でした。社会的地位もお金もすべて手に入れ、やりたいことは何でもできたのです。</p> <p>それでも、彼は自分が退位して引退できる日を心待ちにしていました。世界一の権力を持つ男は、すべての権力を手放すことができる日を考えるときが一番幸せでした。<sup>8</sup></p> <p>名声や富や権力を追い求めながら、それを達成した後もずっと不幸であることに人生を費やすのは、なんと愚かなことでしょうか? その目的は何でしょう? 他人を感動させるため? それは本当に価値があることなのでしょうか?</p> <p>同時に、権力や地位のゲームに巻き込まれる人たちは、少なくともいくらかは許されます。彼らはそれを行うための多くの社会的圧力に直面しており、これらの目標が価値があると思うよう騙されています。</p> <p>一方、空虚な喜びや現実逃避に時間を費やす人は、不名誉であり、鬱陶しい存在です。良いことなんて何もありません。<sup>9</sup></p> <p><b>DKB: では、あなたにとって良い人生とは何でしょうか? あなたは、地位や権力を追い求めるべきではないと言っていますが、かと言って、空虚な喜びを追い求めるべきでもありません。</b></p> <p><b>何もしないでビーチに寝そべっていればいいのでしょうか?</b></p> <p>セネカ: 一日中ビーチに寝そべっていろと言っているのではありません。私は自分にとって楽しく、そして世界にとって価値のあることを見つけるべきだと言っているのです。<sup>10</sup></p> <p>自分の時間を少しずつ奪われるのではなく、意図的に人生を送るべきです。毎日を最後の日として、次の日を待ち望むことを恐れることもないように、毎日を整理すべきです。あたなにとって本当に重要ではない人たちや物事のために時間を費やすことは避けなければなりません。</p> <p>あなたは自分の時間を倹約すべきです。なぜなら、時間と引き換えにする価値のあるものは何もないと知っているからです。<sup>11</sup></p> <p>私が前に言いたかったのは、いつも忙しくしている人が、高齢まで生きたからといって、長生きしたことにはならない、ということです。ただ、長く生きてきただけなのです。</p> <p>例えば、航海に出て、港を出たところで激しい嵐に巻き込まれ、帰ってくるまでぐるぐる回されたとします。あなたは長い航海をしたわけではなく、ただ長い間翻弄されただけなのです。<sup>12</sup></p> <p>どうでも良いことに時間を費やすのをやめ、数少ない重要なことに集中すべきなのです。</p> <p>その上で、寿命を延ばすためにできることが一つあります。先人たちの哲学を学ぶことで、彼らの経験を吸収するのです。哲学書を読むたびに、その著者の寿命が自分の寿命に加算されていくのです。哲学を学ぶことほど、素晴らしい時間の使い方はないでしょう。<sup>13</sup></p> <p>ソクラテスと議論し、カルネアデスで懐疑し、エピクロスと安らぎ、ストア派と人間性を克服し、キュニコス派とその限界を超えることができるのです。限りなく永遠である過去に、心から身を捧げることができるのです。<sup>14</sup></p> <p>過去の人たちも素晴らしい友人になります。ピタゴラスやアリストテレスやその他の人たちは、決して忙しくて会えないということはありません。彼らはいつも、あなたを見つけたときよりも良い状態で残してくれるでしょう。誰もあなたに死ぬことを強要しませんが、全員が死に方を教えてくれます。誰もあなたの年を無駄にすることはありませんが、それぞれがあなたの年に自分の年を加えてくれます。あなたは毎日彼らに相談することができ、彼らはいつもあなたに真実を教えてくれるでしょう。<sup>15</sup></p> <p>これが、あなたの寿命を延ばす唯一の方法です。あなたの名誉のための建物や記念碑は、すべてすぐに破壊されます。時の流れは、哲学の偉大な作品以外のすべてを破壊します。どんな時代も、それらを消し去ったり、減少させたりすることはありません。時が経てば、より尊敬されるようになるだけです。<sup>16</sup></p> <p><b>DKB: 最後に金言をお願いできますか?</b></p> <p>セネカ: 私たちが本当に生きている人生の一部は小さいものです。</p> <p>残りはすべては人生ではなく、単なる時間です。</p> <hr> <h3>脚注</h3> <ol><li>「われわれが手にしている時間は、決して短くない。むしろ、われわれが、たくさんの時間を浪費しているのだ。実際、人生は十分に長い。そして、偉大な仕事を成し遂げるに十分な時間が、惜しみなく与えられている。ただし、それは、人生全体が有効に活用されるならの話だ。」</li><br> <li>「人は自分の土地を誰にも奪わせないし、土地の境界線をめぐるいさかいが少しでもあれば、石や武器を手に争おうとする。しかし、自分の人生の中に他人が侵入することを許してしまう。それどころか、自分の人生を乗っ取ってしまう輩を自ら招き入れることさえあるのだ。」</li><br> <li>「自分の金銭を喜んで分け与える人などいないだろう。なのに、だれもかれもが、たくさんの人たちに自分の人生を分け与えているのだ! 人は、自分の財産を管理するときには倹約家だが、時間を使うときになると、浪費家になってしまう。ケチであることを褒めてもらえるのは、唯一このときだけだというのに。」</li><br> <li>「まことに、あなたたちの人生は、たとえそれが千年以上続いたとしても、ほんの僅かな期間に短縮されてしまうだろう。あなたたちの悪徳が、すべての時間空間を喰らい尽くしてしまうのだ。」</li><br> <li>「では、その理由は何なのだろう? それは、あなたたちがまるで永遠に生きられるかのように生きているからだ。自分の脆さにいつまでも気づかず、どれだけたくさんの時間が過ぎてしまったかを、気にもとめないからだ。まるで時間が豊かにあふれる泉から湧いてくるかのように浪費しているからだ。その一方で、そんなことをしているうちに、あなたたちの最後の日となる、まさにその日がやってくるだろう。あなたたちはどんなことでも、死すべき人間のように恐れる。そのくせ、どんなことでも、不死なる神のように欲するのだ。」</li><br> <li>「人生で最も貴重なものを軽んじているのだ。彼らがそんな間違いを犯すのは、時間が形を持たず、目に見えないからだ。だから時間はとても安く見積もられている。それどころか、ほぼ無価値なものとされている。年金や謝礼であれば、人々は喜んで受け取る。そのためには自分から働きかけ、骨を折り、努力する。しかし、時間を高く評価する者は誰もいない。人々は時間を、まるで何の費用もかからないかのように惜しげもなく使う。だが、もし、その同じ人たちの近くに、死の恐怖にさらされたらどうなるだろうか。彼らが医者にすがりつく姿を見ることだろう。死刑の恐怖にさらされたらどうなるだろう。彼らが全財産を投げ打ってでも生きながらえようとする姿を見ることだろう。」</li><br> <li>「先見の明があると自惚れている人たちの意見くらい、愚かなものはないのではなかろうか? 彼らは自分たちの生活を向上させるために、多忙を極めている。生を築こうとして、生を使い果たしてしまう。彼らは、遠い将来を見据えて計画を立てる。ところが、先延ばしは、人生の最大の浪費なのだ。先延ばしは、次から次に、日々を奪い去っていく。それは、未来を担保にして、今このときを奪い取るのだ。生きる上での最大の障害は「期待」である。期待は明日にすがって、今日を滅ぼすからだ。あなたは、運命の手の中にあるものを計画し、自分の手の中にあるものを取り逃してしまう。あなたはどこを見ているのか? あなたはどこを目指しているのか? これからやってくることは、みな不確かではないか。今すぐ生きなさい。」</li><br> <li>「彼には、余暇がとても素晴らしいものに見えた。だからこそ彼は、それを現実に楽しむことが叶わぬとき、想像によって先取りして楽しんでいるのである。彼は、すべてが自分一人の意のままになると知っていた人だ。個人と国の運命を決めた人だ。その彼が、最も喜びに満たされていたのは、自らの偉大さを捨て去るその日のことを、思い描く時だったのである。」</li><br> <li>「ここで、最悪の事例の一つとして、酒と性に関することにしか時間を使おうとしない連中に触れておきたい。なぜなら、これほど恥ずべき時間の使い方をしている者はいないからだ。それに比べれば、たとえ栄光という空しい幻想の虜になっているような場合であっても、その過ちは見苦しいものではない。なんなら、強欲な人とか短期な人とか、あるいは正当性のない怨恨や争いごとに固執している人などを挙げてもらっても構わない。これらの人たちも、みな間違いを犯しているが、まだしも男らしいではないか。これに対して、食欲や性欲に耽る連中の振る舞いは、唾棄すべき恥辱でしかないのだ。」</li><br> <li>「わたしは、あなたに、怠惰で退屈な休息を勧めるつもりはない。あなたのうちにある生き生きとした活力を、惰眠や大衆に親しまれている娯楽で紛らわせよというつもりもない。そもそも、そんなものは休息ではない。そうではなく、あなたは、そこに大切な仕事を見出すことになるのだ。それは、あなたがこれまで一生懸命に果たしてきたどの仕事よりも、大切な仕事だ。あなたは世間から離れ、心静かに、その仕事に取り組むことになるのだ。」</li><br> <li>「いいかね。人間の誤りを乗り越えた偉大な人物は、自分の時間から、なにひとつ取り去られることを許さない。それゆえ、彼の人生はきわめて長いのである。なぜなら、彼は、自分の自由になる時間が長かろうが短かろうが、それをすべて自分のためだけに使うからだ。彼の時間が使われずに眠っていることなどなかったし、他人に支配されることもなかった。なぜなら、彼は、自分の時間と交換できるほど価値のあるものなど、なにひとつ見出さなかったからだ。」</li><br> <li>「そのようなわけで、ある人の髪の毛が白いとか、顔にしわが寄っているからと言って、その人が長く生きてきたと認める理由にはならない。その人は、長く生きていたのではない。単に長く存在していただけなのだ。ある人が、港を出たとたん、激しい嵐に襲われたとしよう。彼は、あちらへこちらへと流されていった。そして、荒れ狂う風が四方八方から吹きつけ、同じところをくるくると引き回された。さてどうだろう? あなたは、その人が長く航海していたとみなすだろうか? その人は長く航海していたのではない。たんに長く振り回されていただけなのだ。」</li><br> <li>「すべての人間の中で、閑暇な人といえるのは、英知を手にするために時間を使う人だけだ。そのような人だけが、生きているといえる。なぜなら、そのような人は、自分の人生を上手に管理できるだけでなく、自分の時代に、すべての時代を付け加えることができるからだ。彼が生まれる以前に過ぎ去っていったあらゆる年月が、彼の年月に付け加えられるのである。」</li><br> <li>「私たちには、ソクラテスと共に、議論することが許されている。カルネアデスと共に、懐疑することが許されている。エピクロスと共に、安らぐことが許されている。ストア派の哲人たちと共に、人間の性に打ち勝つことが許されている。キュニコス派の哲人たちと共に、人間の性から自由になることが許されている。自然は、私たちに、すべての時代と交流することを許してくれる。ならば、私たちは、この短くはかない時間のうつろいから離れよう。そして、全霊をかたむけて、過去という時間に向き合うのだ。過去は無限で永遠であり、私たちよりも優れた人たちと過ごすことのできる時間なのだから。」</li><br> <li>「すなわち、ゼノン、ピタゴラス、デモクリトスをはじめとする学問の神官たちや、アリストテレス、テオフラストスを、毎日つき合う親友にしたいと望む人たちである。これらの哲人たちは、いつでも時間を空けてくれる。彼らのもとを訪れれば、帰るときにはいっそう幸福になり、自分をいっそう愛するようになっている。彼らのもとを去るときには、手ぶらで帰ることを許してくれない。そして、夜であろうが昼であろうが、すべての人間が、彼らのもとを訪れることができるのである。彼らは、決して、あなたに死を強要しない。むしろ、彼らはみな、あなたに死を教えてくれるだろう。彼らは、決して、あなたの人生の年月を無駄には使わせない。むしろ彼らは、自分の年月を、あなたにつなげてくれるだろう。」</li><br> <li>「これこそ、死すべき生を引き延ばす唯一の方法、いやそれどころか、それを不死なる生に転換する唯一の方法といえるのだ。名誉の称号とか、記念碑のようなもの — すなわち、なんであれ、功名心を満たすために、(元老院で)決議されて交付されたものとか、労役によって建てられたもの — は、いずれ滅び去る。長い年月がすべてを破壊し、変化させてしまうのだ。これに対して、英知の力で神聖になったものは、傷つけることができない。そのような神聖なものが、ある時代に滅んだり、衰えたりすることはないのだ。次の時代、その次の時代と、時がたてばたつほど、ますます尊敬されることだろう。なぜなら、近くにあれば嫉妬心が生まれるが、遠くにあれば素直な気持ちで賞賛できるからだ。」</li></ol></blockquote><p><a href=\"https://news.ycombinator.com/item?id=31885137\">Hacker News</a></p> <p>Article URL: <a href=\"https://okuranagaimo.blogspot.com/2022/07/blog-post.html\">https://okuranagaimo.blogspot.com/2022/07/blog-post.html</a></p> </blockquote>","date_published":"2022-07-03T16:48:03.216Z"}]}